// нож яйцо шлем ложка вилка топор кружка ножницы молоток чайник      тюбик
// юла ключ вилы перец груша замок яблоко ракетка бутылка отвёртка    перчатка
// тарелка зубная_щётка колокольчик ёж
// лопата очки

// http://mnemonikon.ru/members/spr_f.htm

ALL_DATA.push([`

[hard] [digits] [alphanumeric_code]
hoop --- huːp  0  Н М --- обруч --- обруч ХП
hedgehog ---  hedʒhɔːɡ  1  Г Ж --- ёЖ --- ёж ХДЖХГ
iodine --- aɪədaɪn  2  Д Т --- йоД --- йод АДН
tricorn --- trʌɪkɔːn  3  К Х --- треуголка -- треуголка ТРКН
cue --- kjuː  3  К Х --- Кий --- КЮ Кий
glove --- ɡlʌv  5  П Б --- перчатка --- перчатка ГЛВ
buoy --- bɔɪ  5  П Б --- Буй --- буй БОЙ
whirligig --- wɜːrliɡɪɡ  6  Ш Л --- юЛа --- юла ВРЛГГ
wasp --- wɑːsp  7  С З --- оСа --- оса ВСП
octopus --- ɑːktəpəs  8  В Ф --- спрут --- спрут ОКТПС
willow --- wɪloʊ  8  В Ф --- иВа --- ива ВЛ
gloom --- ɡluːm  20  ДН ДМ ТН ТМ --- ТьМа --- тьма ГЛМ

    `,`

[words-X0#] [digits] [alphanumeric_code]
mine --- maɪn    00  МН НМ --- МиНа --- МАЙН мина
menu --- menjuː  00  МН НМ --- МеНю --- МЕНЮ menu
fire --- faɪər   10  ГН ГМ ЖН ЖМ --- оГоНь --- ФАЙЕР оГоНь
wife --- waɪf    10  ГН ГМ ЖН ЖМ --- ЖеНа --- ВАЙФ ЖеНа
shadow --- ʃædoʊ     20  ДН ДМ ТН ТМ --- ТеНь --- ШАДОУ ТеНь
bottom --- bɑːtəm    20  ДН ДМ ТН ТМ --- ДНо --- БООТЭМ ДНо
daytime --- deɪtaɪm  20  ДН ДМ ТН ТМ --- ДеНь --- ДЭЙТАЙМ день
gloom --- ɡluːm      20  ДН ДМ ТН ТМ --- ТьМа --- ГЛУУМ тьма
movie --- muːvi   30  КН КМ ХН ХМ --- КиНо --- МУВИ КиНо
icon  --- aɪkɑːn  30  КН КМ ХН ХМ --- иКоНа --- АЙКОН икона
henna --- henə    30  КН КМ ХН ХМ --- ХНа --- ХЕНЭ хна
khan --- kɑːn     30  КН КМ ХН ХМ --- ХаН --- КААН хан
horse --- hɔːrs   30  КН КМ ХН ХМ --- КоНь --- ХОРС КоНь
vat --- væt  40  ЧН ЧМ ЩН ЩМ --- ЧаН, ЧМо, ЧиН --- ВЭТ ЧаН
accordion --- ə'kɔːrdiən  50  ПН ПМ БН БМ --- БаяН accordion, ПеНь, БаНя, ПаН --- АККОРДИОН БаяН
tire --- taɪər  60  ШН ШМ ЛН ЛМ --- ШиНа tire, ЛёН, ШуМ --- ТАЙЭР ШиНа
hay --- heɪ  70  СН СМ ЗН ЗМ --- СеНо hay, ЗоНа, ЗиМа, СоН, СоНя --- ХЭЙ СеНо
hairdryer --- herdraɪər  80  ВН ВМ ФН ФМ --- ФеН hairdryer, ВеНа, ВиНо, ФоМа --- ХЕРДРАЙЕР ФеН
rum --- rʌm  90  РН РМ ЦН ЦМ --- РоМ rʌm, уРаН, РеНо, РаНа, РиМ --- РАМ РоМ
gnome --- noʊm  100  ГЖ_НМ_НМ --- ГНоМ gnome, ЖаННа --- НОУМ ГНоМ

        `,`

[words-0#] [digits] [alphanumeric_code]
hole --- hoʊl  0  Н М --- яМа --- ХОЛл в яМе
ring --- rɪŋ  0  Н М --- кольцо --- РИН кольцо
finger-ring --- fɪŋɡər rɪŋ  0  Н М --- перстень --- ФИНГУР РИН перстень
hoop --- huːp  0  Н М --- обруч --- ХУУП обруч
hedgehog ---  hedʒhɔːɡ  1  Г Ж --- ёЖ --- ХЕДЖХОГ ёЖ
iodine --- aɪədaɪn  2  Д Т --- йоД --- АЙЭДАЙН йоД
tricorn --- trʌɪkɔːn  3  К Х --- треуголка -- ТРАЙКОН треуголка
cue --- kjuː  3  К Х --- Кий --- КЬЮУ Кий
cross --- krɔːs  4  Ч Щ --- крест --- КРОСс крест
tea --- tiː  4  Ч Щ --- Чай --- ТИИ Чай
star --- stɑːr  5  П Б --- звезда --- СТАРая звезда
glove --- ɡlʌv  5  П Б --- перчатка --- ГЛАВная перчатка
buoy --- bɔɪ  5  П Б --- Буй --- БОЙ Буя
wallpaper --- wɔːlpeɪpə  5  П Б --- оБои --- УОЛПЕЙПЭ оБои
whirligig --- wɜːrliɡɪɡ  6  Ш Л --- юЛа --- ВОР ЛИ ГИГ юЛа
wasp --- wɑːsp  7  С З --- оСа --- ВАСП оСа
octopus --- ɑːktəpəs  8  В Ф --- спрут --- ОКТЭПЭС спрут
willow --- wɪloʊ  8  В Ф --- иВа --- ВИЛЛА иВа
egg --- eɡ  9  Р Ц --- яйЦо --- ЭГ яйЦо
fire --- faɪər  10  ГН ГМ ЖН ЖМ --- оГоНь --- ФАЙЕР оГоНь
wife --- waɪf  10  ГН ГМ ЖН ЖМ --- ЖеНа --- ВАЙФ ЖеНа

  `,`

[0#] [digits] [alphanumeric_code]
0  --- Н М --- яМа, кольцо, перстень, обруч --- Н М
1  --- Г Ж --- ёЖ --- Г Ж
2  --- Д Т --- йоД --- Д Т
3  --- К Х --- треуголка, Кий, уХо --- К Х
4  --- Ч Щ --- крест, Чай --- Ч Щ
5  --- П Б --- звезда, перчатка, Буй, оБои --- П Б
6  --- Ш Л --- юЛа --- Ш Л
7  --- С З --- оСа --- С З
8  --- В Ф --- спрут, осьминог, иВа --- В Ф
9  --- Р Ц --- яйЦо --- Р Ц
10 --- ГН ГМ ЖН ЖМ --- ЖеНа, оГоНь --- ГН ГМ ЖН ЖМ

    `,`

[X0#] [digits] [alphanumeric_code]
00  --- МН НМ --- МиНа, МеНю --- МН НМ
10  --- ГН ГМ ЖН ЖМ --- оГоНь, ЖеНа --- ГН ГМ ЖН ЖМ
20  --- ДН ДМ ТН ТМ --- ДНо, ДеНь, ТеНь, ТьМа --- ДН ДМ ТН ТМ
30  --- КН КМ ХН ХМ --- КоНь, иКоНа, КиНо, ХаН, ХНа --- КН КМ ХН ХМ
40  --- ЧН ЧМ ЩН ЩМ --- ЧМо, ЧиН, ЧаН --- ЧН ЧМ ЩН ЩМ
50  --- ПН ПМ БН БМ --- БаяН, ПеНь, БаНя, ПаН --- ПН ПМ БН БМ
60  --- ШН ШМ ЛН ЛМ --- ШиНа, ЛёН, ШуМ --- ШН ШМ ЛН ЛМ
70  --- СН СМ ЗН ЗМ --- СеНо, ЗоНа, ЗиМа, СоН, СоНя --- СН СМ ЗН ЗМ
80  --- ВН ВМ ФН ФМ --- ФеН, ВеНа, ВиНо, ФоМа --- ВН ВМ ФН ФМ
90  --- РН РМ ЦН ЦМ --- РоМ, уРаН, РеНо, РаНа, РиМ --- РН РМ ЦН ЦМ
100 --- ГЖ_НМ_НМ --- ГНоМ, ЖаННа --- ГЖ_НМ_НМ

    `,`

[00#] [digits] [alphanumeric_code]
00  --- МН НМ --- --- МиНа
01  --- МГ МЖ НГ НЖ --- --- НоЖ
02  --- МД МТ НД НТ --- --- МёД
03  --- МК МХ НК НХ --- --- МаК
04  --- МЧ МЩ НЧ НЩ --- --- МяЧ
05  --- МБ МП НБ НП --- --- аМёБа
06  --- МШ МЛ НШ НЛ --- --- МеЛ
07  --- МС МЗ НС НЗ --- --- НоС
08  --- МВ МФ НВ НФ --- --- НиВа
09  --- МР МЦ НР НЦ --- --- МиР
010 --- НМ_КХ_НМ --- --- НоЖНы

    `,`

[11#] [digits] [alphanumeric_code]
10 --- --- --- оГоНь
11 --- --- --- ГаГарин
12 --- --- --- ГиТара
13 --- --- --- ГайКа
14 --- --- --- ЖуЧок
15 --- --- --- ГуБы
16 --- --- --- ГуаШь
17 --- --- --- ГуСь
18 --- --- --- ГВоздь
19 --- --- --- ГиРя
20 --- --- --- ДоМ

    `,`

[61#] [digits] [alphanumeric_code]
60 --- --- --- ШиНа
61 --- --- --- ЛыЖи
62 --- --- --- ЛаДья
63 --- --- --- ЛейКа
64 --- --- --- ЛуЧ
65 --- --- --- ЛуПа
66 --- --- --- ШиЛо
67 --- --- --- ЛиСа
68 --- --- --- оЛоВо
69 --- --- --- ШаР
70 --- --- --- СаНи

    `,`

[AxB-hard#] [multiplication_table] [alphanumeric_code]
яйЦо на крест  --- 36 --- --- КЛей
яйЦо на перчатку --- 45 --- --- ЧиП
яйЦо на юЛа  --- 54 --- --- ПеЧь
яйЦо на оСа  --- 63 --- --- ЛейКа
яйЦо на осьминог  --- 72 --- --- СиТо
осьминог на перчатку  --- 40 --- --- ЧайНик
осьминог на юЛа   --- 48 --- --- ЩаВель
осьминог на оСа   --- 56 --- --- ПиЛа
осьминог на яйЦо  --- 72 --- --- СиТо

    `,`

[AxB-super-hard#] [multiplication_table] [alphanumeric_code]
яйЦо да юЛа --- 54 --- --- ПеЧь
осьминог да оСа  --- 56 --- --- ПиЛа
юЛа да яйЦо --- 54 --- --- ПеЧь
оСа да осьминог --- 56 --- --- ПиЛа

    `,`

[XX#] [digits] [alphanumeric_code]
0   --- hoʊl --- hole --- яМа
0   --- rɪŋ --- ring --- кольцо
0   --- --- перстень
0   --- --- обруч
1   --- --- ёЖ
2   --- --- йоД
3   --- --- треуголка
3   --- --- Кий
3   --- --- уХо
4   --- --- крест
4   --- --- Чай
5   --- --- звезда
5   --- --- перчатка
5   --- --- Буй
5   --- --- оБои
6   --- --- юЛа
7   --- --- оСа
8   --- --- спрут
8   --- --- иВа
9   --- --- яйЦо
10  --- --- ЖеНа
10  --- --- оГоНь
00  --- --- МиНа
01  --- --- НоЖ
02  --- --- МёД
03  --- --- МаК
04  --- --- МяЧ
05  --- --- аМёБа
06  --- --- МеЛ
07  --- --- НоС
08  --- --- НиВа
09  --- --- МиР
010 --- --- НоЖНы
11  --- --- ГаГарин
12  --- --- ГиТара
13  --- --- ГайКа
14  --- --- ЖуЧок
15  --- --- ГуБы
16  --- --- ГуаШь
17  --- --- ГуСь
18  --- --- ГВоздь
19  --- --- ГиРя
20  --- --- ДоМ
21  --- --- уТюГ
22  --- --- ДиоД
23  --- --- ДуХи
24  --- --- ДиЧь
25  --- --- ТоПор
26  --- --- ДуШ
27  --- --- ТуЗ
28  --- --- уДаВ
29  --- --- ТеРка
30  --- --- иКоНа
31  --- --- КоЖа
32  --- --- КиТ
33  --- --- КеКс
34  --- --- КоЧан
35  --- --- КуБик
36  --- --- КЛей
37  --- --- КоСа
38  --- --- ХВоя
39  --- --- яКоРь
40  --- --- ЧайНик
41  --- --- ЧуГунок
42  --- --- ЩиТ
43  --- --- оЧКи
44  --- --- ЧуЧело
45  --- --- ЧиП
46  --- --- ЧаШка
47  --- --- ЧаСы
48  --- --- ЩаВель
49  --- --- ЧеРеп
50  --- --- БаяН
51  --- --- ПоГоны
52  --- --- БиТа
53  --- --- ПауК
54  --- --- ПеЧь
55  --- --- ПюПитр
56  --- --- ПиаЛа
57  --- --- БуСы
58  --- --- ПиВо
59  --- --- ПеРо
60  --- --- ШиНа
61  --- --- ЛыЖи
62  --- --- ЛаДья
63  --- --- ЛейКа
64  --- --- ЛуЧ
65  --- --- ЛуПа
66  --- --- ШиЛо
67  --- --- ЛиСа
68  --- --- оЛоВо
69  --- --- ШаР
70  --- --- СаНи
71  --- --- СиГара
72  --- --- СиТо
73  --- --- яЗыК
74  --- --- СаЧок
75  --- --- ЗуБ
76  --- --- СоЛь
77  --- --- СоуС
78  --- --- СейФ
79  --- --- СыР
80  --- --- ФеН
81  --- --- ВаГон
82  --- --- ВаТа
83  --- --- ВаКса
84  --- --- оВоЩ
85  --- --- ВоБла
86  --- heɪfɔːrk --- hayfork --- ВиЛы
87  --- skeɪlz --- scales --- ВеСы
88  --- --- ВаФли
89  --- hedlaɪt --- headlight --- ФаРа
90  --- ɜːn --- urn --- уРНа
91  --- hɔːrnz --- horns --- РоГа
92  --- reɪdioʊ --- radio --- РаДио
93  --- kænsər --- cancer --- РаК
94  --- striːm --- stream --- РуЧей
95  --- tɜːrnɪp --- turnip --- РеПа
96  --- rʌdər --- rudder --- РуЛь
97  --- roʊz --- rose --- РоЗа
98  --- hɑːrp --- harp --- аРФа
99  --- pɔːrtəbl reɪdioʊ --- portable radio --- РаЦия
100 --- noʊm --- gnome --- ГНоМ

    `,`

`]);

// 1 - ГЖ
// 2 - ДТ
// 3 - КХ
// 4 - ЧЩ
// 5 - ПБ
// 6 - ШЛ
// 7 - СЗ
// 8 - ВФ
// 9 - РЦ
// 0 - НМ

// 15 --- --- --- ГуБы
// 14 --- --- --- ЖуЧок
// 16 --- --- --- ГуаШь
// 19 --- --- --- ГиРя
// 30 --- --- --- иКоНа
// 42 --- --- --- ЩиТ
// 52 --- --- --- БиТа
// 84 --- --- --- оВоЩ
// 64 --- --- --- ЛуЧ
