ALL_DATA.push([

`
[0#] [digits] [alphanumeric_code]
0  --- Н М --- кольцо, перстень, обруч --- яМа
1  --- Г Ж --- ёЖ
2  --- Д Т --- йоД --- яД
3  --- К Х --- треуголка --- Кий
4  --- Ч Щ --- крест --- Чай
5  --- П Б --- звезда, перчатка, Буй --- оБои
6  --- Ш Л --- юЛа
7  --- С З --- оСа
8  --- В Ф --- осьминог --- иВа
9  --- Р Ц --- яйЦо
10 --- ГН ГМ ЖН ЖМ --- ЖеНа --- оГоНь
`,

`
[00#] [digits] [alphanumeric_code]
00  --- --- --- МиНа МН НМ
01  --- --- --- НоЖ МГ МЖ НГ НЖ
02  --- --- --- МёД МД МТ НД НТ
03  --- --- --- МаК МК МХ НК НХ
04  --- --- --- МяЧ МЧ МЩ НЧ НЩ
05  --- --- --- аМёБа МБ МП НБ НП
06  --- --- --- МеЛ МШ МЛ НШ НЛ
07  --- --- --- НоС МС МЗ НС НЗ
08  --- --- --- НиВа МВ МФ НВ НФ
09  --- --- --- МиР МР МЦ НР НЦ
010 --- --- --- НоЖНы
`,

`
[11#] [digits] [alphanumeric_code]
10 --- --- --- оГоНь
11 --- --- --- ГаГарин
12 --- --- --- ГиТара
13 --- --- --- ГайКа
14 --- --- --- ЖуЧок
15 --- --- --- ГуБы
16 --- --- --- ГуаШь
17 --- --- --- ГуСь
18 --- --- --- ГВоздь
19 --- --- --- ГиРя
20 --- --- --- ДоМ
`,

`
[61#] [digits] [alphanumeric_code]
60 --- --- --- ШиНа
61 --- --- --- ЛыЖи
62 --- --- --- ЛаДья
63 --- --- --- ЛейКа
64 --- --- --- ЛуЧ
65 --- --- --- ЛуПа
66 --- --- --- ШиЛо
67 --- --- --- ЛиСа
68 --- --- --- оЛоВо
69 --- --- --- ШаР
70 --- --- --- СаНи
`,

`
[AxB-hard#] [multiplication_table] [alphanumeric_code]
яйЦо на крест  --- 36 --- --- КЛей
яйЦо на перчатку --- 45 --- --- ЧиП
яйЦо на юЛа  --- 54 --- --- ПеЧь
яйЦо на оСа  --- 63 --- --- ЛейКа
яйЦо на осьминог  --- 72 --- --- СиТо
осьминог на перчатку  --- 40 --- --- ЧайНик
осьминог на юЛа   --- 48 --- --- ЩаВель
осьминог на оСа   --- 56 --- --- ПиЛа
осьминог на яйЦо  --- 72 --- --- СиТо
`,

`
[AxB-super-hard#] [multiplication_table] [alphanumeric_code]
яйЦо да юЛа --- 54 --- --- ПеЧь
осьминог да оСа  --- 56 --- --- ПиЛа
юЛа да яйЦо --- 54 --- --- ПеЧь
оСа да осьминог --- 56 --- --- ПиЛа
`,

]);

// 1 - ГЖ
// 2 - ДТ
// 3 - КХ
// 4 - ЧЩ
// 5 - ПБ
// 6 - ШЛ
// 7 - СЗ
// 8 - ВФ
// 9 - РЦ
// 0 - НМ

// 15 --- --- --- ГуБы
// 14 --- --- --- ЖуЧок
// 16 --- --- --- ГуаШь
// 19 --- --- --- ГиРя
// 30 --- --- --- иКоНа
// 42 --- --- --- ЩиТ
// 52 --- --- --- БиТа
// 84 --- --- --- оВоЩ
// 64 --- --- --- ЛуЧ
