// нож яйцо шлем ложка вилка топор кружка ножницы молоток чайник      тюбик
// юла ключ вилы перец груша замок яблоко ракетка бутылка отвёртка    перчатка
// тарелка зубная_щётка колокольчик ёж
// лопата очки

// http://mnemonikon.ru/members/spr_f.htm

// ж

/*

н — 6.35%
т — 6.30%
р — 5.53%
с — 5.45%
л — 4.32%
в — 4.19%
к — 3.47%
п — 3.35%
м — 3.29%
у — 2.90%
д — 2.56%
з — 1.81%
б — 1.51%
г — 1.41%

1.27 + 0.92 + 0.78 + 0.52 + 0.49
ч — 1.27%
х — 0.92%
ж — 0.78%
ш — 0.77%
ц — 0.52%
щ — 0.49%

ф — 0.40%

Д З

0 Н                 = 6.35 = Носорог, Норка, оНдатра, еНот
1 К - 3.47 Г - 1.41 = 4.48 = Конь, Гиена, Кошка, Корова, Козёл, Гусь
2 Л - 4.32          = 4.32 = Лось, Лиса, Лев, Лягушка, Лебедь
3 Т                 = 6.30 = Тигр, уТка, Тюлень
4 Ч Х Щ Ж Ц         = 4.00 = Черепаха, Жираф, Хамелеон, Цапля, ёЖ
5 П - 3.35 Б - 1.51 = 4.86 = Пингвин, Попугай, Павлин, Бурундук, Белка, зеБра, Петух, Панда, Барсук, Баран, Бабёр
6 Ш - 0.77 М - 3.29 = 4.06 = Шакал, Муравьед, Мышь, Медуза
7 С                 = 5.45 = Свинья, Сурок, Сова, Слон, Собака, оСёл
8 В - 4.19 Ф - 0.40 = 4.59 = Верблюд, Ворона, Фламинго, оВца
9 Р                 = 5.53 = РыСь, Росомаха, Рак, оРангутанг
*/

ALL_DATA.push([`


    `,`

[персонажи] [digits] [alphanumeric_code]
1   --- --- уЖ
hedgehog ---  hedʒhɔːɡ 1 --- ёЖ --- ёЖ [ХДЖХГ]
octopus --- ɑːktəpəs 8 --- спрут --- спрут [ОКТПС]
horse --- hɔːrs 30 --- КоНь --- КоНь [ХС]
05  --- --- аМёБа
06  --- --- МыШь
09  --- --- МоРж
21  --- --- ТиГр
028 --- --- МеДВедь
10  --- --- ГНу
10  --- --- ГиеНа
19  --- --- ЖиРаф
11  --- --- ГаГарин
17  --- --- ГуСь
23  --- --- уТКа
28  --- --- уДаВ
32  --- --- КиТ
36  --- --- аКуЛа
37  --- --- КоЗёл
39  --- --- КоРова
39  --- --- КРаб
39  --- --- КуРица
43  --- --- ЧайКа
50  --- --- ПаНда
52  --- --- ПеТух
53  --- --- ПауК
56  --- --- БеЛка
55  --- --- ПоПугай
59  --- --- БаРан
60  --- --- оЛеНь
61  --- --- ЛяГушка
62  --- --- уЛиТка
67  --- --- ЛиСа
67  --- --- ЛоСь
68  --- --- ЛеВ
70  --- --- ЗМея
75  --- --- ЗеБра
76  --- --- оСёЛ
76  --- --- СЛон
78  --- --- СВинья
78  --- --- СоВа
79  --- --- ЗаяЦ
85  --- --- ВоБла
86  --- --- ВоЛк
93  --- --- РаК
97  --- --- РыСь
gnome --- noʊm  100 --- ГНоМ --- ГНоМ [НМ]
268 --- --- ДеЛьФин
301 --- --- КеНГуру
393 --- --- КРоКодил
495 --- --- ЧеРеПаха
501 --- --- ПиНГвин
554 --- --- БаБоЧка
563 --- --- ПеЛиКан
586 --- --- ПаВЛин
729  --- --- СТРаус
camel --- kæməl 895 --- ВеРБлюд [КМЛ]

    `,`

[hard] [digits] [alphanumeric_code]
hoop --- huːp  0  Н М --- обруч --- обруч [ХП]
hedgehog ---  hedʒhɔːɡ  1  Г Ж --- ёЖ --- ёж [ХДЖХГ]
iodine --- aɪədaɪn  2  Д Т --- йоД --- йод [АДН]
tricorn --- trʌɪkɔːn  3  К Х --- треуголка --- треуголка [ТРКН]
ear --- ɪr, ɪə  3  К Х --- уХо --- уХо [И]
cue --- kjuː  3  К Х --- Кий --- Кий [КЮ]
glove --- ɡlʌv  5  П Б --- перчатка --- перчатка [ГЛВ]
buoy --- bɔɪ  5  П Б --- Буй --- буй [БЙ]
whirligig --- wɜːrliɡɪɡ  6  Ш Л --- юЛа --- юла [ВРЛГ]
wasp --- wɑːsp  7  С З --- оСа --- оса [ВСП]
octopus --- ɑːktəpəs  8  В Ф --- спрут --- спрут [ОКТПС]
willow --- wɪloʊ  8  В Ф --- иВа --- иВа [ВЛ]
gloom --- ɡluːm  20  ДН ДМ ТН ТМ --- ТьМа --- тьма [ГЛМ]
vat --- væt    40  ЧН ЧМ ЩН ЩМ --- ЧаН --- ЧаН [ВТ]
rank --- ræŋk  40  ЧН ЧМ ЩН ЩМ --- ЧиН --- ЧиН [РНК]

    `,`

[words-X0#] [digits] [alphanumeric_code]
mine --- maɪn    00  МН НМ --- МиНа --- мина [МН]
menu --- menjuː  00  МН НМ --- МеНю --- menu [МН]
fire --- faɪər   10  ГН ГМ ЖН ЖМ --- оГоНь --- оГоНь [ФР]
wife --- waɪf    10  ГН ГМ ЖН ЖМ --- ЖеНа --- ЖеНа [ВФ]
shadow --- ʃædoʊ     20  ДН ДМ ТН ТМ --- ТеНь --- ТеНь [ШД]
bottom --- bɑːtəm    20  ДН ДМ ТН ТМ --- ДНо --- ДНо [БТМ]
daytime --- deɪtaɪm  20  ДН ДМ ТН ТМ --- ДеНь --- день [ДТМ]
gloom --- ɡluːm      20  ДН ДМ ТН ТМ --- ТьМа --- тьма [ГЛМ]
melon --- melən      20  ДН ДМ ТН ТМ --- ДыНя --- ДыНя [МЛН]
movie --- muːvi   30  КН КМ ХН ХМ --- КиНо --- КиНо [МВ]
icon  --- aɪkɑːn  30  КН КМ ХН ХМ --- иКоНа --- икона [АКН]
henna --- henə    30  КН КМ ХН ХМ --- ХНа --- хна [ХН]
khan --- kɑːn     30  КН КМ ХН ХМ --- ХаН --- хан [КН]
horse --- hɔːrs   30  КН КМ ХН ХМ --- КоНь --- КоНь [ХС]
vat --- væt    40  ЧН ЧМ ЩН ЩМ --- ЧаН --- ЧаН [ВТ]
rank --- ræŋk  40  ЧН ЧМ ЩН ЩМ --- ЧиН --- ЧиН [РНК]
accordion --- ə'kɔːrdiən  50  ПН ПМ БН БМ --- БаяН --- БаяН [АКРДН]
pan --- pan               50  ПН ПМ БН БМ --- ПаН --- ПаН [ПН]
bathhouse --- bæθhaʊs     50  ПН ПМ БН БМ --- БаНя --- БаНя [БФХС]
stump --- stʌmp           50  ПН ПМ БН БМ --- ПеНь --- ПеНь [СТМП]
tire --- taɪər  60  ШН ШМ ЛН ЛМ --- ШиНа --- ШиНа [ТР]
whir --- wɜːr   60  ШН ШМ ЛН ЛМ --- ШуМ --- ШуМ [УР]
flax --- flæks  60  ШН ШМ ЛН ЛМ --- ЛёН --- ЛёН [ФЛКС]
zone --- zoʊn             70  СН СМ ЗН ЗМ --- ЗоНа --- ЗоНа [ЗН]
hay --- heɪ               70  СН СМ ЗН ЗМ --- СеНо --- СеНо [ХЙ]
winter --- wɪntər         70  СН СМ ЗН ЗМ --- ЗиМа --- ЗиМа [УНТР]
sleep --- sliːp           70  СН СМ ЗН ЗМ --- СоН --- СоН [СЛП]
sleepyhead --- sliːpihed  70  СН СМ ЗН ЗМ --- СоНя --- СоНя [СЛПХД]
hairdryer --- herdraɪər   80  ВН ВМ ФН ФМ --- ФеН --- ФеН [ХРДРР]
vein --- veɪn   80  ВН ВМ ФН ФМ --- ВеНа --- ВеНа [ВН]
wine --- waɪn   80  ВН ВМ ФН ФМ --- ВиНо --- ВиНо [УН]
rum --- rʌm             90  РН РМ ЦН ЦМ --- РоМ --- РоМ [РМ]
Rome --- roʊm  90  РН РМ ЦН ЦМ --- РиМ --- РиМ [РМ]
uranium --- juˈreɪniəm  90  РН РМ ЦН ЦМ --- уРаН --- уРаН [ЮРНМ]
wound --- wuːnd         90  РН РМ ЦН ЦМ --- РаНа --- РаНа [УНД]
gnome --- noʊm  100  ГЖ_НМ_НМ --- ГНоМ --- ГНоМ [НМ]

        `,`

[words-0#] [digits] [alphanumeric_code]
hole --- hoʊl  0  Н М --- яМа --- яМа [ХЛ]
ring --- rɪŋ  0  Н М --- кольцо --- кольцо [РН]
finger-ring --- fɪŋɡər rɪŋ  0  Н М --- перстень --- перстень [ФНГРН]
hoop --- huːp  0  Н М --- обруч --- обруч [ХП]
hedgehog ---  hedʒhɔːɡ  1  Г Ж --- ёЖ --- ёЖ [ХДХГ]
iodine --- aɪədaɪn  2  Д Т --- йоД --- йоД [АДН]
tricorn --- trʌɪkɔːn  3  К Х --- треуголка --- треуголка [ТРКН]
cue --- kjuː  3  К Х --- Кий --- Кий [КЮ]
ear --- ɪr, ɪə  3  К Х --- уХо --- уХо [И]
cross --- krɔːs  4  Ч Щ --- крест --- крест [КРС]
tea --- tiː  4  Ч Щ --- Чай --- Чай [Т]
star --- stɑːr  5  П Б --- звезда --- звезда [СТР]
glove --- ɡlʌv  5  П Б --- перчатка --- перчатка [ГЛВ]
buoy --- bɔɪ  5  П Б --- Буй --- Буй [БЙ]
wallpaper --- wɔːlpeɪpə  5  П Б --- оБои --- оБои [УЛППР]
whirligig --- wɜːrliɡɪɡ  6  Ш Л --- юЛа --- юЛа [УРЛГГ]
wasp --- wɑːsp  7  С З --- оСа --- оСа [ВСП]
octopus --- ɑːktəpəs  8  В Ф --- спрут --- спрут [ОКТПС]
willow --- wɪloʊ  8  В Ф --- иВа --- иВа [УЛЛ]
egg --- eɡ  9  Р Ц --- яйЦо --- яйЦо [ЭГ]
fire --- faɪər  10  ГН ГМ ЖН ЖМ --- оГоНь --- оГоНь [ФР]
wife --- waɪf  10  ГН ГМ ЖН ЖМ --- ЖеНа --- ЖеНа [ВФ]

  `,`

[0#] [digits] [alphanumeric_code]
0  --- Н М --- яМа, кольцо, перстень, обруч --- Н М
1  --- Г Ж --- ёЖ --- Г Ж
2  --- Д Т --- йоД --- Д Т
3  --- К Х --- треуголка, Кий, уХо --- К Х
4  --- Ч Щ --- крест, Чай --- Ч Щ
5  --- П Б --- звезда, перчатка, Буй, оБои --- П Б
6  --- Ш Л --- юЛа --- Ш Л
7  --- С З --- оСа --- С З
8  --- В Ф --- спрут, осьминог, иВа --- В Ф
9  --- Р Ц --- яйЦо --- Р Ц
10 --- ГН ГМ ЖН ЖМ --- ЖеНа, оГоНь --- ГН ГМ ЖН ЖМ

    `,`

[X0#] [digits] [alphanumeric_code]
00  --- МН НМ --- МиНа, МеНю --- МН НМ
10  --- ГН ГМ ЖН ЖМ --- оГоНь, ЖеНа --- ГН ГМ ЖН ЖМ
20  --- ДН ДМ ТН ТМ --- ДНо, ДеНь, ТеНь, ТьМа --- ДН ДМ ТН ТМ
30  --- КН КМ ХН ХМ --- КоНь, иКоНа, КиНо, ХаН, ХНа --- КН КМ ХН ХМ
40  --- ЧН ЧМ ЩН ЩМ --- ЧМо, ЧиН, ЧаН --- ЧН ЧМ ЩН ЩМ
50  --- ПН ПМ БН БМ --- БаяН, ПеНь, БаНя, ПаН --- ПН ПМ БН БМ
60  --- ШН ШМ ЛН ЛМ --- ШиНа, ЛёН, ШуМ --- ШН ШМ ЛН ЛМ
70  --- СН СМ ЗН ЗМ --- СеНо, ЗоНа, ЗиМа, СоН, СоНя --- СН СМ ЗН ЗМ
80  --- ВН ВМ ФН ФМ --- ФеН, ВеНа, ВиНо, ФоМа --- ВН ВМ ФН ФМ
90  --- РН РМ ЦН ЦМ --- РоМ, уРаН, РеНо, РаНа, РиМ --- РН РМ ЦН ЦМ
100 --- ГЖ_НМ_НМ --- ГНоМ, ЖаННа --- ГЖ_НМ_НМ

    `,`

[00#] [digits] [alphanumeric_code]
00  --- МН НМ --- --- МиНа
01  --- МГ МЖ НГ НЖ --- --- НоЖ
02  --- МД МТ НД НТ --- --- МёД
03  --- МК МХ НК НХ --- --- МаК
04  --- МЧ МЩ НЧ НЩ --- --- МяЧ
05  --- МБ МП НБ НП --- --- аМёБа
05  --- МБ МП НБ НП --- --- аМПула
06  --- МШ МЛ НШ НЛ --- --- МеЛ
07  --- МС МЗ НС НЗ --- --- НоС
08  --- МВ МФ НВ НФ --- --- НиВа
09  --- МР МЦ НР НЦ --- --- МиР
010 --- НМ_КХ_НМ --- --- НоЖНы

    `,`

[11#] [digits] [alphanumeric_code]
10 --- --- --- оГоНь
11 --- --- --- ГаГарин
12 --- --- --- ГиТара
13 --- --- --- ГайКа
14 --- --- --- ЖуЧок
15 --- --- --- ГуБы
16 --- --- --- ГуаШь
17 --- --- --- ГуСь
18 --- --- --- ГВоздь
19 --- --- --- ГиРя
20 --- --- --- ДоМ

    `,`

[61#] [digits] [alphanumeric_code]
60 --- --- --- ШиНа
61 --- --- --- ЛыЖи
62 --- --- --- ЛаДья
63 --- --- --- ЛейКа
64 --- --- --- ЛуЧ
65 --- --- --- ЛуПа
66 --- --- --- ШиЛо
67 --- --- --- ЛиСа
68 --- --- --- оЛоВо
69 --- --- --- ШаР
70 --- --- --- СаНи

    `,`

[AxB-hard#] [multiplication_table] [alphanumeric_code]
яйЦо на крест  --- 36 --- --- КЛей
яйЦо на перчатку --- 45 --- --- ЧиП
яйЦо на юЛа  --- 54 --- --- ПеЧь
яйЦо на оСа  --- 63 --- --- ЛейКа
яйЦо на осьминог  --- 72 --- --- СиТо
осьминог на перчатку  --- 40 --- --- ЧайНик
осьминог на юЛа   --- 48 --- --- ЩаВель
осьминог на оСа   --- 56 --- --- ПиЛа
осьминог на яйЦо  --- 72 --- --- СиТо

    `,`

[AxB-super-hard#] [multiplication_table] [alphanumeric_code]
яйЦо да юЛа --- 54 --- --- ПеЧь
осьминог да оСа  --- 56 --- --- ПиЛа
юЛа да яйЦо --- 54 --- --- ПеЧь
оСа да осьминог --- 56 --- --- ПиЛа

    `,`

[XX#] [digits] [alphanumeric_code]
0   --- hoʊl --- hole --- яМа
0   --- rɪŋ --- ring --- кольцо
0   --- --- перстень
0   --- --- обруч
1   --- --- ёЖ
2   --- --- йоД
3   --- --- треуголка
3   --- --- Кий
3   --- --- уХо
4   --- --- крест
4   --- --- Чай
5   --- --- звезда
5   --- --- перчатка
5   --- --- Буй
5   --- --- оБои
6   --- --- юЛа
7   --- --- оСа
8   --- --- спрут
8   --- --- иВа
9   --- --- яйЦо
10  --- --- ЖеНа
10  --- --- ЖМых
10  --- --- оГоНь
00  --- --- МиНа
01  --- --- НоЖ
02  --- --- МёД
03  --- --- МаК
04  --- --- МяЧ
05  --- --- аМПула
06  --- --- МеЛ
07  --- --- НоС
08  --- --- НиВа
09  --- --- МиР
010 --- --- НоЖНы
11  --- --- ГаГарин
12  --- --- ГиТара
13  --- --- ГайКа
14  --- --- ЖуЧок
15  --- --- ГуБы
16  --- --- ГуаШь
17  --- --- ГуСь
18  --- --- ГВоздь
19  --- --- ГиРя
20  --- --- ДоМ
21  --- --- уТюГ
22  --- --- ДиоД
23  --- --- ДуХи
24  --- --- ДиЧь
25  --- --- ТоПор
26  --- --- ДуШ
27  --- --- ТуЗ
28  --- --- уДаВ
29  --- --- ТеРка
30  --- --- иКоНа
31  --- --- КоЖа
32  --- --- КиТ
33  --- --- КеКс
34  --- --- КоЧан
35  --- --- КуБик
36  --- --- КЛей
37  --- --- КоСа
38  --- --- ХВоя
39  --- --- яКоРь
40  --- --- ЧайНик
41  --- --- ЧуГунок
42  --- --- ЩиТ
43  --- --- оЧКи
44  --- --- ЧуЧело
45  --- --- ЧиП
46  --- --- ЧаШка
47  --- --- ЧаСы
48  --- --- ЩаВель
49  --- --- ЧеРеп
50  --- --- БаяН
51  --- --- ПоГоны
52  --- --- БиТа
53  --- --- ПауК
54  --- --- ПеЧь
55  --- --- ПюПитр
56  --- --- ПиаЛа
57  --- --- БуСы
58  --- --- ПиВо
59  --- --- ПеРо
60  --- --- ШиНа
61  --- --- ЛыЖи
62  --- --- ЛаДья
63  --- --- ЛейКа
64  --- --- ЛуЧ
65  --- --- ЛуПа
66  --- --- ШиЛо
67  --- --- ЛиСа
68  --- --- оЛоВо
69  --- --- ШаР
70  --- --- СаНи
71  --- --- СиГара
72  --- --- СиТо
73  --- --- яЗыК
74  --- --- СаЧок
75  --- --- ЗуБ
76  --- --- СоЛь
77  --- --- СоуС
78  --- --- СейФ
79  --- --- СыР
80  --- --- ФеН
81  --- --- ВаГон
82  --- --- ВаТа
83  --- --- ВаКса
84  --- --- оВоЩ
85  --- --- ВоБла
86  --- heɪfɔːrk --- hayfork --- ВиЛы
87  --- skeɪlz --- scales --- ВеСы
88  --- --- ВаФли
89  --- hedlaɪt --- headlight --- ФаРа
90  --- ɜːn --- urn --- уРНа
91  --- hɔːrnz --- horns --- РоГа
92  --- reɪdioʊ --- radio --- РаДио
93  --- kænsər --- cancer --- РаК
94  --- striːm --- stream --- РуЧей
95  --- tɜːrnɪp --- turnip --- РеПа
96  --- rʌdər --- rudder --- РуЛь
97  --- roʊz --- rose --- РоЗа
98  --- hɑːrp --- harp --- аРФа
99  --- pɔːrtəbl reɪdioʊ --- portable radio --- РаЦия
100 --- noʊm --- gnome --- ГНоМ

    `,`

`]);

// 1 - ГЖ
// 2 - ДТ
// 3 - КХ
// 4 - ЧЩ
// 5 - ПБ
// 6 - ШЛ
// 7 - СЗ
// 8 - ВФ
// 9 - РЦ
// 0 - НМ

// 15 --- --- --- ГуБы
// 14 --- --- --- ЖуЧок
// 16 --- --- --- ГуаШь
// 19 --- --- --- ГиРя
// 30 --- --- --- иКоНа
// 42 --- --- --- ЩиТ
// 52 --- --- --- БиТа
// 84 --- --- --- оВоЩ
// 64 --- --- --- ЛуЧ
