ALL_DATA.push([

`
0# digits alphanumeric_code
0 --- --- --- яМа
0 --- --- --- кольцо,перстень,обруч
1 --- --- --- ёЖ
2 --- --- --- яД,йоД
3 --- --- --- Кий
3 --- --- --- треуголка
4 --- --- --- Чай
4 --- --- --- крест
5 --- --- --- оБои
5 --- --- --- звезда,перчатка
6 --- --- --- юЛа
7 --- --- --- оСа
8 --- --- --- иВа
9 --- --- --- яйЦо
10 --- --- --- оГоНь
`,

`
00# digits alphanumeric_code
00  --- --- --- МиНа_МН-МН
01  --- --- --- НоЖ_МН-ГЖ
02  --- --- --- МёД_МН-ДТ
03  --- --- --- МаК_МН-КХ
04  --- --- --- МяЧ_МН-ЧЩ
05  --- --- --- аМёБа_МН-ПБ
06  --- --- --- МеЛ_МН-ШЛ
07  --- --- --- НоС_МН-СЗ
08  --- --- --- НиВа_МН-ВФ
09  --- --- --- МиР_МН-РЦ
010 --- --- --- НоЖНы_МН_ГЖ_МН
`,

`
11# digits alphanumeric_code
10 --- --- --- оГоНь
11 --- --- --- ГаГарин
12 --- --- --- ГиТара
13 --- --- --- ГайКа
14 --- --- --- ЖуЧок
15 --- --- --- ГуБы
16 --- --- --- ГуаШь
17 --- --- --- ГуСь
18 --- --- --- ГВоздь
19 --- --- --- ГиРя
20 --- --- --- ДоМ
`,

`
61# digits alphanumeric_code
60 --- --- --- ШиНа
61 --- --- --- ЛыЖи
62 --- --- --- ЛаДья
63 --- --- --- ЛейКа
64 --- --- --- ЛуЧ
65 --- --- --- ЛуПа
66 --- --- --- ШиЛо
67 --- --- --- ЛиСа
68 --- --- --- оЛоВо
69 --- --- --- ШаР
70 --- --- --- СаНи
`,

`
AxB-hard# multiplication_table alphanumeric_code
яйЦо на Чай  --- 36 --- --- КЛей
яйЦо на оБои --- 45 --- --- ЧиП
яйЦо на юЛа  --- 54 --- --- ПеЧь
яйЦо на оСа  --- 63 --- --- ЛейКа
яйЦо на иВа  --- 72 --- --- СиТо
иВа на оБои  --- 40 --- --- ЧайНик
иВа на юЛа   --- 48 --- --- ЩаВель
иВа на оСа   --- 56 --- --- ПиЛа
иВа на яйЦо  --- 72 --- --- СиТо
`,

`
AxB-super-hard# multiplication_table alphanumeric_code
яйЦо да юЛа --- 54 --- --- ПеЧь
иВа да оСа  --- 56 --- --- ПиЛа
юЛа да яйЦо --- 54 --- --- ПеЧь
оСа да иВа  --- 56 --- --- ПиЛа
`,

]);

// 1 - ГЖ
// 2 - ДТ
// 3 - КХ
// 4 - ЧЩ
// 5 - ПБ
// 6 - ШЛ
// 7 - СЗ
// 8 - ВФ
// 9 - РЦ
// 0 - НМ

// 15 --- --- --- ГуБы
// 14 --- --- --- ЖуЧок
// 16 --- --- --- ГуаШь
// 19 --- --- --- ГиРя
// 30 --- --- --- иКоНа
// 42 --- --- --- ЩиТ
// 52 --- --- --- БиТа
// 84 --- --- --- оВоЩ
// 64 --- --- --- ЛуЧ
