// нож яйцо ложка вилка топор кружка ножницы молоток чайник   тюбик
// юла ключ перец груша замок яблоко ракетка бутылка отвёртка перчатка
// тарелка зубная_щётка колокольчик ёж
// лопата вилы очки

ALL_DATA.push([`

[hard] [digits] [alphanumeric_code]
hoop --- huːp  0  Н М --- обруч --- ХУУП обруч
hedgehog ---  hedʒhɔːɡ  1  Г Ж --- ёЖ --- ХЕДЖХОГ ёЖ
iodine --- aɪədaɪn  2  Д Т --- йоД --- АЙЭДАЙН йоД
tricorn --- trʌɪkɔːn  3  К Х --- треуголка -- ТРАЙКОН треуголка
cue --- kjuː  3  К Х --- Кий --- КЬЮУ Кий
glove --- ɡlʌv  5  П Б --- перчатка --- ГЛАВная перчатка
buoy --- bɔɪ  5  П Б --- Буй --- БОЙ Буя
whirligig --- wɜːrliɡɪɡ  6  Ш Л --- юЛа --- ВОР ЛИ ГИГ юЛа
wasp --- wɑːsp  7  С З --- оСа --- ВАСП оСа
octopus --- ɑːktəpəs  8  В Ф --- спрут --- ОКТЭПЭС спрут
willow --- wɪloʊ  8  В Ф --- иВа --- ВИЛЛА иВа

    `,`

[words0] [digits] [alphanumeric_code]
hole --- hoʊl  0  Н М --- яМа --- ХОЛл в яМе
ring --- rɪŋ  0  Н М --- кольцо --- РИН кольцо
finger-ring --- fɪŋɡər rɪŋ  0  Н М --- перстень --- ФИНГУР РИН перстень
hoop --- huːp  0  Н М --- обруч --- ХУУП обруч
hedgehog ---  hedʒhɔːɡ  1  Г Ж --- ёЖ --- ХЕДЖХОГ ёЖ
iodine --- aɪədaɪn  2  Д Т --- йоД --- АЙЭДАЙН йоД
tricorn --- trʌɪkɔːn  3  К Х --- треуголка -- ТРАЙКОН треуголка
cue --- kjuː  3  К Х --- Кий --- КЬЮУ Кий
cross --- krɔːs  4  Ч Щ --- крест --- КРОСс крест
tea --- tiː  4  Ч Щ --- Чай --- ТИИ Чай
star --- stɑːr  5  П Б --- звезда --- СТАРая звезда
glove --- ɡlʌv  5  П Б --- перчатка --- ГЛАВная перчатка
buoy --- bɔɪ  5  П Б --- Буй --- БОЙ Буя
wallpaper --- wɔːlpeɪpə  5  П Б --- оБои --- УОЛПЕЙПЭ оБои
whirligig --- wɜːrliɡɪɡ  6  Ш Л --- юЛа --- ВОР ЛИ ГИГ юЛа
wasp --- wɑːsp  7  С З --- оСа --- ВАСП оСа
octopus --- ɑːktəpəs  8  В Ф --- спрут --- ОКТЭПЭС спрут
willow --- wɪloʊ  8  В Ф --- иВа --- ВИЛЛА иВа
egg --- eɡ  9  Р Ц --- яйЦо --- ЭГ яйЦо
fire --- faɪər  10  ГН ГМ ЖН ЖМ --- оГоНь --- ФАЙЕР оГоНь
wife --- waɪf  10  ГН ГМ ЖН ЖМ --- ЖеНа --- ВАЙФ ЖеНа

  `,`

[0#] [digits] [alphanumeric_code]
0 hoʊl --- Н М --- яМа hole, кольцо ring, перстень, обруч --- яМа hole
1 hedʒhɔːɡ --- Г Ж --- ёЖ hedgehog --- ёЖ hedgehog
2 aɪədaɪn --- Д Т --- йоД iodine --- йоД iodine
3 trʌɪkɔːn --- К Х --- треуголка tricorn, Кий --- треуголка tricorn
4 krɔːs --- Ч Щ --- крест cross, Чай tea --- крест cross
5 stɑːr --- П Б --- звезда star, перчатка, Буй, оБои --- звезда star
6 wɜːrliɡɪɡ --- Ш Л --- юЛа whirligig --- юЛа whirligig
7 wɑːsp --- С З --- оСа wasp --- оСа wasp
8 ɑːktəpəs --- В Ф --- спрут, осьминог octopus, иВа --- спрут octopus
9 eɡ --- Р Ц --- яйЦо egg --- яйЦо egg
10 faɪər --- ГН ГМ ЖН ЖМ --- ЖеНа, оГоНь fire --- оГоНь fire

    `,`

[X0#] [digits] [alphanumeric_code]
00 maɪn --- МН НМ --- МиНа mine, МеНю --- МиНа mine
10 faɪər --- ГН ГМ ЖН ЖМ --- оГоНь fire, ЖеНа --- оГоНь fire
20 ʃædoʊ --- ДН ДМ ТН ТМ --- ДНо, ДеНь, ТеНь shadow, ТьМа --- ТеНь shadow
30 muːvi --- КН КМ ХН ХМ --- иКоНа, ХаН, ХНа, КиНо movie --- КиНо movie
30 hɔːrs --- КН КМ ХН ХМ --- КоНь --- КоНь horse
40 væt --- ЧН ЧМ ЩН ЩМ --- ЧМо, ЧиН, ЧаН vat --- ЧаН vat
50 ə'kɔːrdiən --- ПН ПМ БН БМ --- БаяН accordion, ПеНь, БаНя, ПаН --- БаяН accordion
60 taɪər --- ШН ШМ ЛН ЛМ --- ШиНа tire, ЛёН, ШуМ --- ШиНа tire
70 heɪ --- СН СМ ЗН ЗМ --- СеНо hay, ЗоНа, ЗиМа, СоН, СоНя --- СеНо hay
80 herdraɪər --- ВН ВМ ФН ФМ --- ФеН hairdryer, ВеНа, ВиНо, ФоМа --- ФеН hairdryer
90 rʌm --- РН РМ ЦН ЦМ --- РоМ rʌm, уРаН, РеНо, РаНа, РиМ --- РоМ rum
100 noʊm --- ГЖ_НМ_НМ --- ГНоМ gnome, ЖаННа --- ГНоМ gnome

    `,`

[00#] [digits] [alphanumeric_code]
00  --- МН НМ --- --- МиНа
01  --- МГ МЖ НГ НЖ --- --- НоЖ
02  --- МД МТ НД НТ --- --- МёД
03  --- МК МХ НК НХ --- --- МаК
04  --- МЧ МЩ НЧ НЩ --- --- МяЧ
05  --- МБ МП НБ НП --- --- аМёБа
06  --- МШ МЛ НШ НЛ --- --- МеЛ
07  --- МС МЗ НС НЗ --- --- НоС
08  --- МВ МФ НВ НФ --- --- НиВа
09  --- МР МЦ НР НЦ --- --- МиР
010 --- НМ_КХ_НМ --- --- НоЖНы
`,

`
[11#] [digits] [alphanumeric_code]
10 --- --- --- оГоНь
11 --- --- --- ГаГарин
12 --- --- --- ГиТара
13 --- --- --- ГайКа
14 --- --- --- ЖуЧок
15 --- --- --- ГуБы
16 --- --- --- ГуаШь
17 --- --- --- ГуСь
18 --- --- --- ГВоздь
19 --- --- --- ГиРя
20 --- --- --- ДоМ
`,

`
[61#] [digits] [alphanumeric_code]
60 --- --- --- ШиНа
61 --- --- --- ЛыЖи
62 --- --- --- ЛаДья
63 --- --- --- ЛейКа
64 --- --- --- ЛуЧ
65 --- --- --- ЛуПа
66 --- --- --- ШиЛо
67 --- --- --- ЛиСа
68 --- --- --- оЛоВо
69 --- --- --- ШаР
70 --- --- --- СаНи
`,

`
[AxB-hard#] [multiplication_table] [alphanumeric_code]
яйЦо на крест  --- 36 --- --- КЛей
яйЦо на перчатку --- 45 --- --- ЧиП
яйЦо на юЛа  --- 54 --- --- ПеЧь
яйЦо на оСа  --- 63 --- --- ЛейКа
яйЦо на осьминог  --- 72 --- --- СиТо
осьминог на перчатку  --- 40 --- --- ЧайНик
осьминог на юЛа   --- 48 --- --- ЩаВель
осьминог на оСа   --- 56 --- --- ПиЛа
осьминог на яйЦо  --- 72 --- --- СиТо
`,

`
[AxB-super-hard#] [multiplication_table] [alphanumeric_code]
яйЦо да юЛа --- 54 --- --- ПеЧь
осьминог да оСа  --- 56 --- --- ПиЛа
юЛа да яйЦо --- 54 --- --- ПеЧь
оСа да осьминог --- 56 --- --- ПиЛа
`,

]);

// 1 - ГЖ
// 2 - ДТ
// 3 - КХ
// 4 - ЧЩ
// 5 - ПБ
// 6 - ШЛ
// 7 - СЗ
// 8 - ВФ
// 9 - РЦ
// 0 - НМ

// 15 --- --- --- ГуБы
// 14 --- --- --- ЖуЧок
// 16 --- --- --- ГуаШь
// 19 --- --- --- ГиРя
// 30 --- --- --- иКоНа
// 42 --- --- --- ЩиТ
// 52 --- --- --- БиТа
// 84 --- --- --- оВоЩ
// 64 --- --- --- ЛуЧ
