ALL_DATA.push([`

[Крещение] [words] [consonant_sounds]
Крещение --- 988 --- крещение, Владимир --- Крещение
elk --- elk --- лось --- ЕЛ_Кору с лосём под ёлкой --- ЕЛ_Ком
else --- els --- ещё, кроме, иначе --- объЕЛСя, но хочу еще --- объЕЛСя
em'bark --- im'ba:k --- грузить(ся), садиться (на корабль) --- ИМ_'БАК надо грузить --- ИМ_'БАК
em'bed --- im'bed --- закапывать, укреплять, вделывать --- ИМ_'БЕДным, закапывать тяжело --- ИМ_'БЕДным
em'bog --- im'bɔg --- завязнуть в болоте --- ИМ_'БОГ не завязнуть в болоте помог  --- ИМ_'БОГ
em'ploy --- im'plɔi --- служба, держать на службе --- ИМ_'ПЛОхо на службе --- ИМ_'ПЛОхо
em'press --- em'pris --- императрица --- ЕМ_'ПРИСланное императрицей --- ЕМ_'ПРИСланное
empty --- empti --- пустой, опорожнять, пустеть --- ЕМ_ПТИцу на пустой желудок --- ЕМ_ПТИцу
engine --- endʒin --- двигатель, мотор --- ИНЖЕНер мотор собрал --- ИНЖЕНер

    `,`

[Грозный] [words] [consonant_sounds]
Грозный --- 1530-1584, первый царь --- ГуБы иКоНа ГуБы оВоЩ --- Грозный
beach --- bi:tʃ --- морской берег, пляж, отмель, наскочить на отмель --- БИЧ на пляже --- БИЧ
bead --- bi:d --- бусинка --- БИИДон с бусинками --- БИИДон
bеаk --- bi:k--- клюв --- БИИКини в клюве пеликана --- БИИКини
beam --- bi:m --- луч, сияние, улыбка, сиять --- БИИМ сияет улыбкой --- БИИМ
bean --- bi:n --- боб, фасоль --- БИИНокль для бобов --- БИИНокль
bear --- bεə --- медведь --- БЕЭлый медведь --- БЕЭлый
bеаst --- bi:st --- зверь --- БИИСТрый зверь --- БИИСТрый
beat --- bi:t --- бить, отбивать --- БИИТой бить да отбивать --- БИИТой
bеаuty --- bju:ti --- красота, красавица --- БЬЮУ_ТИхо красавицу --- БЬЮУ_ТИхо
beaver --- bi:və --- бобр --- БИИВЕнь у бобра отсох --- БИИВЕнь
beaver --- bi:və --- забрало --- БИИВЕнь забрало проткнул --- БИИВЕнь
beсkоn --- bek(ə)n --- кивать, подзывать --- БЕКоН кивнул официанту и подозвал БЕКоН --- БЕКоН
bеd --- bed --- кровать, постель, клумба, грядка, сажать грядку --- БЕДную кровать превратили в клумбу --- БЕДную

    `,`

[Грозный-2] [words] [consonant_sounds]
Грозный 2 --- 1530-1584, первый царь --- ГуБы иКоНа ГуБы оВоЩ --- Грозный 2
drag --- dræɡ --- тащить(ся), тянуть, землечерпалка --- ДРЭГоценности тащить землечерпалкой --- ДРЭГоценности
draw --- drɔː --- рисовать, чертить --- ДРООжь мешает рисовать --- ДРООжь
draw --- drɔː --- тяга, натяжение, лотерея, тащить, вытаскивать --- ДРООва тащить --- ДРООва
drawer --- drɔː(r) --- чертёжник, рисовальщик --- ДРООРва чертёжник рисовал --- ДРООРва
drawer --- drɔː(r) --- выдвижной ящик --- ДРООРва в выдвижном ящике --- ДРООРва
drawer --- drɔː(r) --- буфетчик --- ДРООРва буфетчик рубил --- ДРООРва
drawers --- drɔː(r)z --- кальсоны --- ДРООЗд в кальсонах --- ДРООЗд
dream --- driːm --- сон, сновидение, мечта, видеть сон, мечтать, сниться --- ДРИИМота сну не помеха --- ДРИИМота
dress --- dres --- платье, одежда, одеваться, наряжаться --- ДРЕСсировщица в платье --- ДРЕСсировщица

    `,`

[Галилео] [words] [consonant_sounds]
Галилео --- 1564-1642, Италия, Пиза --- ГуБы ЛуЧ ГуаШь ЩиТ --- Галилео
сорреr --- kɔpə --- полицейский (разг.) --- КОПЕйка у полицейского --- КОПЕйка
copy --- kɔpi --- экземпляр, рукопись, копия, репродукция, копировать --- КОПИровать копию рукописи --- КОПИровать
copybook --- kɔpibuk --- тетрадь с прописью --- КОПИровать_БУКвы в тетрадь --- КОПИровать_БУКвы
cord --- kɔ:d --- веревка, шнурок, связывать веревкой --- КООрД из веревки на шнурке --- КООрД
cork --- kɔ:k --- пробка, пробковый, затыкать пробкой --- КООКон c пробкой --- КООКон
corn --- kɔ:n --- зерно, сообирать зерно, пшеница --- КООНь в зерне --- КООНь
corn --- kɔ:n --- мозоль --- КООНь с мозолью --- КООНь

    `,`

[Галилео-2] [words] [consonant_sounds]
Галилео 2 --- 1564-1642, Италия, Пиза --- ГуБы ЛуЧ ГуаШь ЩиТ --- Галилео 2
calm --- ka:m --- тишина, спокойствие, спокойный, успокаивать --- КААМин в тишине успокаивает --- КААМин
camel --- kæməl --- верблюд --- КЕМЕЛ это верблюд на сигаретах --- КЕМЕЛ
camp --- kæmp --- лагерь, располагаться лагерем --- КЕМПинг - лагерь для автотуристов --- КЕМПинг
can --- kæn --- мочь, уметь --- КЕНгуру может прыгать --- КЕНгуру
can --- kæn --- бидон, банка консервов, консервировать --- КЕНгуру любит консервы из банки --- КЕНгуру
саnсеl --- kænsəl --- отменять --- КОНСИЛиум отменили --- КОНСИЛиум
candid --- kændid --- искренний --- КАНДИДат искренний --- КАНДИДат

    `,`

[да-Винчи] [words] [consonant_sounds]
да Винчи --- 1452-1519, Италия, Флоренция --- ЖуЧок БиТа ГуБы ГиРя --- да Винчи
chute --- ʃu:t --- крутой скат, стремнина (устар.) --- ШУУТ с крутого ската скатился по жёлобу в стремнину --- ШУУТ
circle --- sə:kl --- круг, окружность, орбита, цикл, вращаться --- CЁОKoЛ на орбите вращается по круг --- CЁОKoЛ
city --- siti --- большой город --- СИТо большого города --- СИТо
claim --- kleim --- требование, требовать, иск, претензия --- КЛЕЙМо требует выставить претензию --- КЛЕЙМо

    `, `

[да-Винчи-2] [words] [consonant_sounds]
да Винчи 2 --- 1452-1519, Италия, Флоренция ---  ЖуЧок БиТа ГуБы ГиРя --- да Винчи 2
add --- æd --- прибавлять, присоединять, дополнять --- АД прибавит проблем --- АД
admire --- əd'maɪər --- любоваться, восхищаться --- ЕДу в МАЕ лобоваться природой --- ЕДу в МАЕ
addict --- ædikt --- пристраститься к чему-либо, нарокоман --- ЭДИК_То наркоман --- ЭДИК_То
ad'mit --- əd'mit --- признавать, допускать, впускать, принимать --- АДин'МИТинг признали и допустили участников --- АДин'МИТинг
ad'mix --- əd'miks --- примешивать, смешивать(ся) --- ЕДу'МИКСером примешивали --- ЕДу'МИКСером
a'dore --- ə'dɔ: --- обожать, поклоняться --- Этот'ДООм обожают и поклоняются --- Этот'ДООм
ad'vice --- əd'vais --- совет, консультация, извещение --- АДе'ВАЙСя мой совет --- АДе'ВАЙСя

    `,`

[Паскаль] [words] [consonant_sounds]
Паскаль --- 1623-1662, Блез Паскаль, Франция --- ГуаШь ДуХи ЛаДья --- Паскаль
ark --- a:k --- ящик, ковчег --- АКула на ковчеге лежала в ящике --- АКула
arm --- a:m --- рука (от кисти до плеча), рукав, ручка (кресла), ветвь (дерева) --- ААМпутировали руку --- ААМпутировали
arm --- a:m --- оружие, вооружаться --- ААМериканское оружие --- ААМериканское
a'rrange --- ə'reɪndʒ --- приводить в порядок, договариваться --- О'РАНЖерею договорились прuвeсти в порядок --- О'РАНЖерею
art --- a:t --- искусство --- ААТака на искусство --- ААТака
ask --- a:sk --- спрашивать --- ААСКет спрашивает молча --- ААСКет
ass --- æs --- задница, осёл, глупец --- ЭСтафету осёл бежит задницей вперёд --- ЭСтафету
a'ssemble --- ə'sembl --- собирать(ся), созывать --- А'СсАМБЛея cобирается раз в год --- А'СсАМБЛея
attic --- ætik --- чердак, мансарда, верхний этаж --- ЭТИКетки на чердаке верхнего этажа --- ЭТИКетки
a'ttract --- ə'trækt ---притягивать, привлекать, пленять --- АТ'РАКционы привелкают и притягивают детей --- АТ'РАКционы
aunt --- a:nt --- тётя --- ААНТенну тётя сломала --- ААНТенну

    `,`

[Паскаль-2] [words] [consonant_sounds]
Паскаль 2 --- 1623-1662, Блез Паскаль, Франция --- ГуаШь ДуХи ЛаДья --- Паскаль 2
соntеnt ---kɔntent --- содержание, суть, содержимое --- КОНь_под_ТЕНТом содержимое прячет --- КОНь_под_ТЕНТом
соntеnt ---kɔntent --- довольство, довольный, удовлетворять --- КОНь_под_ТЕНТом довольный стоит --- КОНь_под_ТЕНТом
contest --- kɔntest --- спор, соперничество, соревнование, оспаривать --- КОНь_ТЕСТируется на спор оспаривает титул --- КОНь_ТЕСТируется
con'tinue --- kən'tinju(:) --- продолжать(ся), оставаться, пребывать --- КОН'ТИНент_на_Юг продолжается --- КОН'ТИНент_на_Юг
con'tort --- kən'tɔ:t --- искривлять, искажать --- КАН'ТООТу исказили музыканты --- КАН'ТООТу
controvert --- kɔntrəvə:t --- оспаривать, полемизировать, спорить, отрицать --- КОНТРОлёр_с_ВЕТераном спорит отрицает льготы --- КОНТРОлёр_с_ВЕТераном

    `,`

[Ломоносов] [words] [consonant_sounds]
Ломоносов --- 1711-1765, Михайло Ломоносов, Архангельск --- ГуСь ГаГарин ЛуПа --- Ломоносов
grunt --- grʌnt --- ворчать, хрюкать, хрюканье, ворчание --- ГРАНаТ хрюкает и ворчит --- ГРАНаТ хрюкает и ворчит --- ГРАНаТ
guard --- ga:d --- охрана, сторожить, бдительность, осторожность, охранять --- ГААДов охранять надо осторожно и бдительно --- ГААДов
guess --- ges --- предположение, догадка, отгадывать, предполагать, догадываться --- ГЕСтапо предполагали что Штрилиц обо всём догадывается --- ГЕСТапо
guеst --- gest --- гость(я), постоялец --- ГЕСТапо гостей не любит --- ГЕСТапо
gull --- gʌl --- чайка --- ГАЛдят чайки над водой --- ГАЛдят
gull --- gʌl --- простак, глупец, дурачить --- ГАЛдят глупцы как чайки --- ГАЛдят
gush --- gʌʃ --- ливень, стремительный поток, (перен.) излияние (чувств), хлынуть, изливать свои чувства --- ГАШеная известь хлынула потоком --- ГАШеная

    `,`

[Ломоносов-2] [words] [consonant_sounds]
Ломоносов 2 --- 1711-1765, Михайло Ломоносов, Архангельск --- ГуСь ГаГарин ЛуПа --- Ломоносов 2
pap --- pæp --- кашка, пюре, эмульсия, паста --- ПАПина кашка вкуснее пюре из маминого соска --- ПАПина
paper --- peipə --- бумага, бумажный, завертывать в бумагу, оклеивать (обоями) --- ПЕЙ_ПЕрвым из бумажного стаканчика --- ПЕЙ_ПЕрвым
par --- pa: --- равенство, номинальная стоимость, на равных началах --- ПААр равенство номинальной стоимости воды и топлива --- ПААр
parcel --- pa:sl --- посылка, пакет, сверток, узел, партия (товара), делить на части, завертывать в пакет --- ПААСЛать посылку с пакетом и свёртками --- ПААСЛать
parch --- ра:tʃ --- слегка поджаривать, сушить, запекаться (о губах), пересыхать (о горле, языке) --- ПААчку сушили да слегка поджарили аж в горле пересохло --- ПААчку
parley --- pa:li --- встреча, конференция, переговоры (воюющих сторон) --- ПААЛИсадник к встреча и переговорам воюющих стророн готов --- ПААЛИсадник
parrot --- pærət --- попугай, бессмысленно повторять --- ПОРЕТ попугай чепуху --- ПОРЕТ
parsley --- pa:sli --- петрушка --- ПААСЛИ где петрушка, а потом где сливы --- ПААСЛИ

    `,`

[Ньютон] [words] [consonant_sounds]
Ньютон --- 1642-1727, Исаак Ньютон, Англия --- ГуаШь ЩиT ГуСь ТуЗ --- Ньютон
mеw --- mju: --- чайка, мяуканье, мяукать --- МЯУкать чайке не дано --- МЯУкать
mew --- mju: --- клетка (для сокола, ястреба), сажать в клетку --- MЯУкать у клетки с ястребом опасно --- MЯУкать
mica --- maikə --- слюда --- МАЙКА в слюде --- МАЙКА
mien --- mi:n --- манера, вид, наружность, выражение лица --- МИНорное выражение лица --- МИНорное
miff --- mif --- (разг.) легкая ссора, размолвка, разозлить(ся) --- МИФ о размолвке --- МИФ
milk --- milk --- молоко, молочный, доить --- МИЛКа молока доит много --- МИЛКа
mill --- mil --- мельница, фабрика, молоть, сбивать в пену --- МИЛя до мельницы --- МИЛя
minus --- mainəs --- минус --- МАЙоНЕЗ при минусовой температуре хранится лучше? --- МАЙоНЕЗ
mirror --- mirə --- зеркало, отображение, отображать --- МИРАжи в зеркале мяукают --- МИРАжи
mirth --- mə:θ --- веселье, радость --- МЕСто для веселья и радости на мельнице --- МЕСто
mis'lay --- mis'lei --- положить не на место, потерять --- МЫС'ЛЕЙ потерялось много, потому что были положены не на место --- МЫС'ЛЕЙ
mis'manage --- mɪs'mænɪdʒ --- плохо управлять, портить --- МИСc_'МЕНЕДЖер плохо управляет и портит место для радости --- МИСc_'МЕНЕДЖер

    `,`

[Ньютон-2] [words] [consonant_sounds]
Ньютон 2 --- 1642-1727, Исаак Ньютон, Англия --- ГуаШь ЩиT ГуСь ТуЗ --- Ньютон 2
barber --- ba:bə --- парикмахер --- БААБЕяге парикмахер сделал стрижку --- БААБЕяге
barber --- ba:bə --- пар над водой в морозный день, сильный морозный ветер --- БААБЕ не нравился сильный морозный ветер --- БААБЕ
bare --- bεə --- голый, обнажённый, пустой, бедный, обнажать, раскрывать --- БЕзрукавка с голыми рукавами --- БЕзрукавка
bark --- bа:k --- кора дерева, сдирать кору, кожу --- БААК из коры дерева --- БААК
bark --- bа:k --- лай, лаять --- БААК лаять не умеет --- БААК
bark --- bа:k --- барк (парусное судно) --- БААК на барке --- БААК
barn --- ba:n --- амбар --- БААНки в амбаре --- БААНки
barrel --- bærəl --- бочонок, бочка, наливать в бочку --- БОРОЛся за бочонок пива --- БОРОЛся
barren --- bær(ə)n --- бесплодный, неплодородный --- БАРАН бесплодный --- БАРАН

    `,`

[Декарт] [words] [consonant_sounds]
Декарт --- 1596-1650, Рене Декарт, Франция --- ГуБы РуЛь ГуаШь БаяН --- Декарт
fit --- fit --- припадок, приступ --- ФИТотерапию от припадков прописали --- ФИТотерапию
fizz --- fiz --- шипеть, шипение, искриться --- ФИЗик шипит на раствор --- ФИЗик
flat --- flæt --- квартира --- ФЛЕйТа в квартире играет --- ФЛЕйТа
flat --- flæt --- плоская поверхность, плоскость, плоский, ровный, гладкий, плоско, скучно, однообразно --- ФЛЕйТа звучит однообразно --- ФЛЕйТа
flaw --- flɔ: --- трещина, недостаток, порок, трескаться, портиться --- ФЛОт потрескался --- ФЛОт
flaw --- flɔ: --- сильный порыв ветра, шквал --- ФЛОтилию шквал сильно порвал --- ФЛОтилию
flea --- fli: --- блоха --- ФЛИгель с блохами --- ФЛИгель
flee --- fli: --- убегать, спасаться бегством, сторониться, избегать --- ФЛИрта избегаю --- ФЛИрта
floor --- flɔ: --- пол, этаж, настилать пол --- ФЛОра на полу выросла --- ФЛОра
fly --- flai --- летать, полет --- ФЛАг летит --- ФЛАг

    `,`

[Декарт 2] [words] [consonant_sounds]
Декарт 2 --- 1596-1650, Рене Декарт, Франция --- ГуБы РуЛь ГуаШь БаяН --- Декарт 2
chide --- tʃaid --- ворчать, выть (о ветре) --- ЧАЙ_Дай ворчал дед --- ЧАЙ_Дай
chief --- tʃi:f --- шеф, начальник, глава, главный, руководитель --- ЧИИФир начальник заварил --- ЧИИФир
child --- tʃaild --- ребёнок --- ЧAЙиЛёД ребенок кладет в чай --- ЧAЙиЛёД
chill --- tʃil --- прохлада, холодный, охлаждаться, холодность (в обращении) --- ЧИЛи охлаждается в прохладе --- ЧИЛи
chilly --- tʃili --- прохладный, зябкий, холодный, неприветливо, сухо --- в ЧИЛИ редко бывает прохладно --- ЧИЛИ
chin --- tʃin --- подбородок --- ЧИНить подбородок --- ЧИНить
china --- tʃainə --- китай --- ЧАЙНый сервиз из Китая --- ЧАЙНый
china --- tʃainə --- фарфоровый сервиз --- ЧАЙНый фарфоровый сервиз --- ЧАЙНый

    `,`

[AB] [words] [consonant_sounds]
a'bash --- ə'bæʃ --- смущать, приводить в замешательство --- Этот_'БЕШеннный меня смущает --- Этот_'БЕШенный
a'bility --- ə'bɪləti --- способность --- О'БИЛИе способностей --- О'БИЛИе
a'bout --- ə'baʊt --- вокруг, около --- A'БбАТ ходил вокруг да около --- А'БбАТ
a'bet --- ə'bɛt --- подстрекать, поощрять, поддерживать (что либо дурное) --- А'БбАТа подтсрекали отречься от религии --- А'БбАТа
a'breast --- ə'brɛst --- в ряд, на одной линии --- А_'БРЕСТ в ряду городов героев --- А_'БРЕСТ
a'byss --- ə'bɪs --- бездна, пучина, пропасть --- Этот_'БИСквит в бездну упал --- Этот_'БИСквит
a'brasion --- ə'breɪʒən --- ссадина, износ, шлифовка --- О'БРЕЙ_ЖЕНу без ссадин и шлифовки --- О'БРЕЙ_ЖЕНу
a'broad --- ə'brɔd --- за границеф --- Этот_'БРОД ведёт за границу --- Этот_'БРОД
a'bstain --- əb'steɪn --- воздерживаться, не употреблять --- ОБ_'СТЕНу воздержись биться --- ОБ_'СТЕНу
a'buse --- ə'bjus --- оскорблять, оскорбление, брань, злоупотреблять, неправильное употребление --- О'БУЗой быть оскорбительно --- О'БУЗой
*rather --- ræðər --- слегка --- ræðər
as though --- əz ðoʊ --- (как) если бы, (как) будто бы, словно, как бы --- əz ðoʊ
stare --- ster --- уставиться, пялиться, глазеть, пристальный взгляд, изумленный взгляд --- СТаРец уставился в бездну --- СТаРец
rail --- reɪl --- ограда, изгородь, поручень, перила, рельс --- reɪl

    `,`

[AC] [words] [consonant_sounds]
aca'demic --- ækəˈdɛmɪk --- учёный --- АКА'ДЕМИК учёный --- АКА'ДЕМИК
access --- æksɛs --- доступ, доступность --- ЭКономная СЕСтра недоступна --- ЭКономная СЕСтра
ac'cord --- ə'kɔrd --- согласие, соглашение, соответствовать --- Этот 'КОД соответствует --- Этот 'КОД
ac'cost --- ə'kɔst --- приветствие, обращение --- Эта 'КОСТь как приветствия --- Эта 'КОСТь
ac'crue --- ə'kru --- прибавлять, нарастать, доставать, выпадать на долю --- Это 'КРУшение выпало на нашу долю --- Это 'КРУшение
ac'cursed --- ə'kɜːrsɪd --- проклятый, злополучный, отвратительный --- Эх 'КОСИТ проклятый от армии --- Эх 'КОСИТ
a'cock --- ə'kɑːk --- набекрень --- Этот 'КОК набекрень колпак носит --- Этот 'КОК
ac'quit --- ə'kwɪt --- выплачивать (долг), выполнять (обязанность), освобождаться от чего-либо --- по Этой 'КВИТанции выплачивать надо --- по Этой 'КВИТанции
ac'ross --- ə'krɔs --- поперёк, на той стороне, крест накрест --- К'РОСс на той стороне поперёк правил --- К'РОСс

    `,`

[AF] [words] [consonant_sounds]
a'ffair --- ə'fεə --- дело --- А'ФЕЯ дело знает --- А'ФЕЯ
af'fect --- ə'fɛkt --- воздействовать, влиять, волновать, затрагивать интересы --- Эф'ФЕКТивно воздействовать на публику --- Эф'ФЕКТивно
af'front --- ə'frʌnt --- оскорблять, оскорбление --- Этот 'ФРАНТ оскорблён --- Этот 'ФРАНТ
a'foot --- ə'fʊt --- пешком, на ходу, в движении --- Этот 'ФУТболист пешком в движении --- Этот 'ФУТболист
after --- æftər --- после, последующий, сзади, затем --- АВТОкатастрофа после пьянки --- АВТОкатастрофа

    `,`

[AG] [words] [consonant_sounds]
a'gain --- ə'gɛn --- опять --- А'ГЕНт опять скрылся --- А'ГЕНт
a'gainst --- ə'gɛnst --- против --- А'ГЕНСТво против клиентов --- А'ГЕНСТво
age --- eɪʤ --- возраст, поколение, стареть --- ЕЙ ДЖинсы не по возрасту --- ЕЙ ДЖинсы
a'go --- ə'goʊ --- тому назад --- Э'ГОистом я был год тому назад --- Э'ГОистом
ag'ree --- ə'gri --- соглашаться --- ОГ'РЫзаться согласитесь неприлично --- ОГ'РЫзаться
aid --- eɪd --- помогать, помощь, помощник --- рЕЙД помощи людям --- рЕЙД

    `,`

[AL] [words] [consonant_sounds]
all --- ɔːl --- всё, целое, полностью --- Съели все ОЛивки --- ОЛивки все съели
alley --- æli --- переулок --- ЕЛЕ по переулку проехали --- ЕЛЕ
ally --- ælaɪ --- союзник, соединять, вступать в союз --- Этот ЛАЙ созникам сигнал --- Этот ЛАЙ
also --- ɔlsoʊ --- также, тоже --- ОЛивки в СОУсе тоже вкусные --- ОЛивки в СОУсе

    `,`

[animal-foot-26] [words] [consonant_sounds]
ant --- ænt --- муравей яблоко ˈæp(ə)l --- --- apple
bear --- beə --- медведь банан bəˈnɑːnə --- --- banana
cat --- kæt --- кошка огурец ˈkjuːkʌmbə --- --- cucumber
duck --- dʌk --- утка дайкон --- --- daikon
elephant --- ˈelɪfənt --- слон баклажан ˈeɡplɑːnt --- --- eggplant
frog --- frɒɡ --- лягушка фига fɪɡ --- --- fig
giraffe --- dʒɪˈrɑːf --- жираф виноград ɡreɪp --- --- grape
horse --- hɔːs --- лошадь фундук ˈheɪz(ə)lnʌt --- --- hazelnut
iguana --- ɪˈɡwɑːnə --- игуана мороженное --- --- ice cream
jackal --- ˈdʒækl --- шакал джэм dʒæm --- --- jam
kangaroo --- ˌkæŋɡəˈruː --- кенгуру киви ˈkiːwiː --- --- kiwi
lion --- ˈlaɪən --- лев лимон ˈlemən --- --- lemon
mouse --- maʊs --- мышь дыня ˈmelən --- --- melon
newt --- njuːt --- тритон мускатный орех ˈnʌtmeɡ --- --- nutmeg
octopus --- ˈɒktəpəs --- осьминог лук ˈʌnjən --- --- onion
penguin  --- ˈpeŋɡwɪn --- пингвин перец ˈpepə --- --- pepper
quail --- kweɪl --- перепел айва kwɪns --- --- quince
rabbit --- ˈræbɪt --- кролик редис ˈrædɪʃ --- --- radish
snake --- sneɪk --- змея шпинат ˈspɪnɪtʃ --- --- spinach
tortoise --- ˈtɔːtəs --- черепаха помидор təˈmɑːtəʊ--- --- tomato
uakari --- wəˈkɑːrɪ --- уакари --- краснолицея обезьяна --- уакари
vulture --- ˈvʌltʃə --- гриф калина vaɪˈbɜːnəm --- --- viburnum
walrus --- ˈwɔːlrəs --- морж арбуз ˈwɔːtəmelən --- --- watermelon
xingu --- shingu --- скат --- xingu river ray --- скат
yak --- jæk --- як йогурт ˈjɒɡət --- --- yogurt
zebra --- ˈzebrə --- зебра цукини (мелкий кабачок) zʊˈkiːnɪ --- --- zucchini
    `,`

`]);
// ‘ ˈ æ ʒ dʒ ʌ

// слово --- произношение --- перевод --- мнемотекст --- подсказка


/*
acock
accursed
*/
