ALL_DATA.push([

  `
  Крещение words consonant_sounds count:4
  Крещение --- 988 --- крещение, Владимир --- 988
  elk --- elk --- лось --- ЕЛ_Ком под ёлкой
  else --- els --- ещё, кроме, иначе --- объЕЛСя, но хочу еще
  em'bark --- im'ba:k --- ГРУЗИТЬ(СЯ), САДИТЬСЯ (на корабль) --- ИМ_'БАК надо грузить
  em'bed --- im'bed --- ЗАКАПЫВАТЬ, УКРЕПЛЯТЬ, ВДЕЛЫВАТЬ --- ИМ_'БЕДным, закапывать тяжело
  em'bog --- im'bɔg --- ЗАВЯЗНУТЬ В БОЛОТЕ --- ИМ_'БОГ не завязнуть в болоте помог
  em'ploy --- im'plɔi --- СЛУЖБА, ДЕРЖАТЬ НА СЛУЖБЕ --- ИМ_'ПЛОхо на службе
  em'press --- em'pris --- ИМПЕРАТРИЦА --- ЕМ_'ПРИСланное императрицей
  empty --- empti --- ПУСТОЙ, ОПОРОЖНЯТЬ, ПУСТЕТЬ --- ЕМ_ПТИцу на пустой желудок
  engine --- endʒin --- ДВИГАТЕЛЬ, МОТОР --- ИНЖЕНер мотор собрал
  `,

  `
  Грозный words consonant_sounds count:4
  Грозный --- 1530-1584 --- первый царь --- 1530-1584 ГуБы иКоНа ГуБы оВоЩ
  beach --- bi:tʃ --- морской берег, пляж, отмель, наскочить на отмель --- БИЧ на пляже
  bead --- bi:d --- бусинка --- БИИДон с бусинками
  bеаk --- bi:k--- клюв --- БИИКини в клюве пеликана
  beam --- bi:m --- луч, сияние, улыбка, сиять --- БИИМ сияет улыбкой
  bean --- bi:n --- боб, фасоль --- БИИНокль для бобов
  bear --- bεə --- медведь --- БЕЭлый медведь
  bеаst --- bi:st --- зверь --- БИИСТрый зверь
  beat --- bi:t --- бить, отбивать --- БИИТой бить да отбивать
  bеаuty --- bju:ti --- красота, красавица --- БЬЮУ_ТИхо красавицу
  beaver --- bi:və --- бобр --- БИИВЕнь у бобра отсох
  beaver --- bi:və --- забрало --- БИИВЕнь забрало проткнул
  beсkоn --- bek(ə)n --- кивать, подзывать --- БЕКоН кивнул официанту и подозвал БЕКоН.
  bеd --- bed --- кровать, постель, клумба, грядка, сажать грядку --- БЕДную кровать превратили в клумбу
  `,

  `
  Грозный-2 words consonant_sounds count:4
  Грозный --- 1530-1584 --- первый царь --- 1530-1584 ГуБы иКоНа ГуБы оВоЩ
  drag --- dræɡ --- тащить(ся), тянуть, землечерпалка --- ДРЭГоценности тащить землечерпалкой
  draw --- drɔː --- рисовать, чертить --- ДРООжь мешает рисовать
  draw --- drɔː --- тяга, натяжение, лотерея, тащить, вытаскивать --- ДРООва тащить
  drawer --- drɔː(r) --- чертёжник, рисовальщик --- ДРООРва чертёжник рисовал
  drawer --- drɔː(r) --- выдвижной ящик --- ДРООРва в выдвижном ящике
  drawer --- drɔː(r) --- буфетчик --- ДРООРва буфетчик рубил
  drawers --- ˈdrɔː(r)z --- кальсоны --- ДРООЗд в кальсонах
  dream --- driːm --- сон, сновидение, мечта, видеть сон, мечтать, сниться --- ДРИИМота сну не помеха
  dress --- dres --- платье, одежда, одеваться, наряжаться --- ДРЕСсировщица в платье
  `,

  `
  Галилео words consonant_sounds count:4
  Галилео --- 1564-1642 --- Италия, Пиза --- 1564-1642 ГуБы ЛуЧ ГуаШь ЩиТ
  сорреr --- kɔpə --- полицейский (разг.) --- КОПЕйка у полицейского
  copy --- kɔpi --- экземпляр, рукопись, копия, репродукция, копировать --- КОПИровать копию рукописи
  copybook --- kɔpibuk --- тетрадь с прописью --- КОПИровать_БУКвы в тетрадь
  cord --- kɔ:d --- веревка, шнурок, связывать веревкой --- КООрД из веревки на шнурке
  cork --- kɔ:k --- пробка, пробковый, затыкать пробкой --- КООКон c пробкой
  corn --- kɔ:n --- зерно, сообирать зерно, пшеница --- КООНь в зерне
  corn --- kɔ:n --- мозоль --- КООНь с мозолью
  `,

  `
  Галилео-2 words consonant_sounds count:4
  Галилео --- 1564-1642 --- Италия --- 1564-1642 ГуБы ЛуЧ ГуаШь ЩиТ
  calm --- ka:m --- тишина, спокойствие, спокойный, успокаивать --- КААМин в тишине успокаивает
  camel --- kæməl --- верблюд --- КЕМЕЛ это верблюд на сигаретах
  camp --- kæmp --- лагерь, располагаться лагерем --- КЕМПинг - лагерь для автотуристов
  can --- kæn --- мочь, уметь --- КЕНгуру может прыгать
  can --- kæn --- бидон, банка консервов, консервировать --- КЕНгуру любит консервы из банки
  саnсеl --- kænsəl --- отменять --- КОНСИЛиум отменили
  candid --- kændid --- искренний --- КАНДИДат искренний
  `,

  `
  да-Винчи words consonant_sounds count:4
  да Винчи --- 1452-1519 --- Италия, Флоренция --- 1452-1519 ЖуЧок БиТа ГуБы ГиРя
  chute --- ʃu:t --- крутой скат, стремнина (устар.) --- ШУУТ с крутого ската скатился по жёлобу в стремнину
  circle --- sə:kl --- круг, окружность, орбита, цикл, вращаться --- CЁОKoЛ на орбите вращается по круг
  city --- siti --- большой город --- СИТо большого города
  claim --- kleim --- требование, требовать, иск, претензия --- КЛЕЙМо требует выставить претензию
  `,

  `
  да-Винчи-2 words consonant_sounds count:4
  да Винчи --- 1452-1519 --- Франция --- 1452-1519 ЖуЧок БиТа ГуБы ГиРя
  across --- ə'krɔs --- поперёк, на той стороне, крест накрест --- К'РОСс на той стороне поперёк правил
  add --- æd --- прибавлять, присоединять, дополнять --- АД прибавит проблем
  addict --- ædikt --- пристраститься к чему-либо, нарокоман --- ЭДИК_То наркоман
  ad'mit --- əd'mit --- признавать, допускать, впускать, принимать --- АДин'МИТинг признали и допустили участников
  ad'mix --- əd'miks --- примешивать, смешивать(ся) --- ЕДу'МИКСером примешивали
  a'dore --- ə'dɔ: --- обожать, поклоняться --- Этот'ДООм обожают и поклоняются
  ad'vice --- əd'vais --- совет, консультация, извещение --- АДе'ВАЙСя мой совет
  a'ffair --- ə'fεə --- дело --- А'ФЕЯ дело знает
  `,

  `
  Паскаль words consonant_sounds count:4
  Паскаль --- 1623-1662 --- Блез Паскаль, Франция --- 1623-1662 ГуаШь ДуХи ЛаДья
  ark --- a:k --- ящик, ковчег --- АКула на ковчеге лежала в ящике
  arm --- a:m --- рука (от кисти до плеча), рукав, ручка (кресла), ветвь (дерева) --- ААМпутировали руку
  arm --- a:m --- оружие, вооружаться --- ААМериканское оружие
  a'rrange --- ə'reɪndʒ --- приводить в порядок, договариваться --- О'РАНЖерею прuвeли в порядок
  art --- a:t --- искусство --- ААТака на искусство
  ask --- a:sk --- спрашивать --- ААСКет спрашивает молча
  ass --- æs --- задница, осёл, глупец --- ЭСтафету осёл бежит задницей вперёд
  a'ssemble --- ə'sembl --- собирать(ся), созывать --- А'СсАМБЛея cобирается раз в год
  attic --- ætik --- чердак, мансарда, верхний этаж --- ЭТИКетки на чердаке верхнего этажа
  a'ttract --- ə'trækt ---притягивать, привлекать, пленять --- АТ'РАКционы привелкают и притягивают детей
  aunt --- a:nt --- тётя --- ААНТенну тётя сломала
  `,

  `
  Паскаль-2 words consonant_sounds count:4
  Паскаль --- 1623-1662 --- Блез Паскаль, Франция --- 1623-1662 ГуаШь ДуХи ЛаДья
  соntеnt ---kɔntent --- содержание, суть, содержимое --- КОНь_под_ТЕНТом содержимое прячет
  соntеnt ---kɔntent --- довольство, довольный, удовлетворять --- КОНь_под_ТЕНТом довольный стоит
  contest --- kɔntest --- спор, соперничество, соревнование, оспаривать --- КОНь_ТЕСТируется на спор оспаривает титул
  con'tinue --- kən'tinju(:) --- продолжать(ся), оставаться, пребывать --- КОН'ТИНент_на_Юг продолжается
  con'tort --- kən'tɔ:t --- искривлять, искажать --- КАН'ТООТу исказили музыканты
  controvert --- kɔntrəvə:t --- оспаривать, полемизировать, спорить, отрицать --- КОНТРОлёр_с_ВЕТераном спорит отрицает льготы
  `,

  `
  Ломоносов words consonant_sounds count:4
  Ломоносов --- 1711-1765 --- Михайло Ломоносов, Архангельск --- 1711-1765 ГуСь ГаГарин ЛуПа
  grunt --- grʌnt --- ворчать, хрюкать, хрюканье, ворчание --- ГРАНаТ хрюкает и ворчит
  guard --- ga:d --- охрана, сторожить, бдительность, осторожность, охранять --- ГАДов охранять надо осторожно и бдительно
  guess --- ges --- предположение, догадка, отгадывать, предполагать, догадываться --- ГЕСтапо предполагали что Штрилиц обо всём догадывается
  guеst --- gest --- гость(я), постоялец --- ГЕСТапо гостей не любит
  gull --- gʌl --- чайка --- ГАЛдят чайки над водой
  gull --- gʌl --- простак, глупец, дурачить --- ГАЛдят глупцы как чайки
  gush --- gʌʃ --- ливень, стремительный поток, (перен.) излияние (чувств), хлынуть, изливать свои чувства --- ГАШеная известь хлынула потоком
  `,

  `
  Ломоносов-2 words consonant_sounds count:4
  Ломоносов --- 1711-1765 --- Михайло Ломоносов, Архангельск --- 1711-1765 ГуСь ГаГарин ЛуПа
  pap --- pæp --- кашка, пюре, эмульсия, паста --- ПАПина кашка вкуснее пюре из маминого соска
  paper --- peipə --- бумага, бумажный, завертывать в бумагу, оклеивать (обоями) --- ПЕЙ_ПЕрвым из бумажного стаканчика
  par --- pa: --- равенство, номинальная стоимость, на равных началах --- ПААр равенство номинальной стоимости воды и топлива
  parcel --- pa:sl --- пакет, сверток, узел, партия (товара), делить на части, завертывать в пакет --- ПААСЛать посылку с пакетом и свёртками
  parch --- ра:tʃ --- слегка поджаривать, сушить, запекаться (о губах), пересыхать (о горле, языке) --- ПААчку сушить
  parley --- pa:li --- встреча, конференция, переговоры (воюющих сторон) --- ПААЛИсадник к встреча и переговорам воюющих стророн готов
  parrot --- pærət --- попугай, бессмысленно повторять --- ПОРЕТ попугай чепуху
  parsley --- pa:sli --- петрушка --- ПААСЛИ где петрушка, а потом где сливы
  `,

  `
  Ньютон words consonant_sounds count:4
  Нютон --- 1642-1727 --- Исаак Ньютон, Англия --- 1642-1727 ГуаШь Щит ГуСь ТуЗ
  mеw --- mju: --- чайка, мяуканье, мяукать --- МЯУкать чайке не дано
  mew --- mju: --- клетка (для сокола, ястреба), сажать в клетку --- MЯУкать у клетки с ястребом опасно
  mica --- maikə --- слюда --- МАЙКА в слюде
  mien --- mi:n --- манера, вид, наружность, выражение лица --- МИНорное выражение лица
  miff --- mif --- (разг.) легкая ссора, размолвка, разозлить(ся) --- МИФ о размолвке.
  milk --- milk --- молоко, молочный, доить --- МИЛКа корова дает молоко
  mill --- mil --- мельница, фабрика, молоть, сбивать в пену --- МИЛя до мельницы
  minus --- mainəs --- минус --- МАЙоНЕЗ при минусовой температуре хранится лучше
  mirror --- mirə --- зеркало, отображение, отображать --- МИРАжи в зеркале мяюкают
  mirth --- mə:θ --- веселье, радость --- МЕСто для веселья и радости на мельнице
  mis'lay --- mis'lei --- положить не на место, потерять --- МЫСЛЕЙ потерялось много, потому что были положены не на место
  mismanage --- mɪsˈmænɪdʒ --- ПЛОХО УПРАВЛЯТЬ, ПОРТИТЬ --- МИСc_МЕНЕДЖер плохо управляет и портит место для радости
  `,

  /* ‘ ˈ æ ʒ dʒ ʌ */ ]);
