  ALL_DATA.push([`

      `,`

  [wraith-1] [wraith] [consonant_sounds]
  wraith --- reɪθ --- призрак, видение --- reɪθ в опере
  mess --- mes --- грязь, беспорядок, месива --- МЕСиво из грязи --- МЕСиво
  torn --- tɔːrn --- разодранный, порванный, разорванный, продранный --- ТООРНадо разодранный в клочья --- ТООРНадо
  flesh --- fleʃ --- плоть, мясо, тело, мякоть плода, сырое мясо --- ФЛЭШка из плоти --- ФЛЭШка
  muscle --- mʌsl --- мышца, мускул, сила --- МАСЛо для мышц --- МАСЛо
  tendon --- tendən --- сухожилие --- ТЕНь_и_ДЕНь сухожилия порвали --- ТЕНь_и_ДЕНь
  rip --- rɪp, rɪpt --- разрыв, разрез, прореха, рвать, рваться, распарывать, пороться --- РИПейник от разрыва не поможет --- РИПейник
  bone --- boʊn --- кость, костяк, костный, костяной, снимать мясо с костей --- БОНд сломал кость --- БОНд
  right --- raɪt --- прямо --- raɪt через одежду --- РАЙТ прямо братья --- РАЙТ
  fur --- fɜː(r), fɜːz --- мех, шерсть, пушнина, налет, меховой, пушной, отделывать мехом --- ФЁЁкла мех любит --- ФЁЁкла
  leather --- leðə(r), leðə(r)z  --- кожа, ремень, краги, кожаный, крыть кожей --- ЛЕВая кожанная сумка --- ЛЕВая
  careful --- kɛəful --- осторожный --- КАФЕЛь осторожный мастер кладёт --- КАФЕЛь
  carefully --- kɛrfəli --- осторожно, аккуратно --- КАФЕЛь_Им аккуратно выложили --- КАФЕЛь_Им
  grip --- grɪp --- схватить, крепко держать, подхватить --- ГРИПп схватил за горло --- ГРИПп
  shoulder --- ʃoʊldər --- плечо, лопатка, брать на себя, взвалить на плечи --- ШОУ_Ли_ДЕРьмовое
  pull --- pʊl --- тянуть, тащить --- ПУЛя тащит смерть --- ПУЛя
  slip --- slɪp --- скользить, проскальзывать --- СЛИПнувшись скользить легче --- СЛИПнувшись
  slippery --- slɪpəri --- скользкий --- slɪpəri пол
  behind --- bɪ'haɪnd --- за, позади, сзади, после, вслед, зад --- bɪ'haɪnd Москва
  stain --- steɪn --- пятно, пятнать, пачкать --- СТЕЙНгазету пятно пачкает --- СТЕЙНгазету
  blood --- blʌd --- кровь --- blʌd остановилась
  cobalt --- koʊbɔːlt --- кобальт --- КОУ'БООЛТовый болт --- КОУ'БООЛТовый
  strand --- strænd --- прядь, садиться на мель --- СТРАНная_Девочка с прядями села на мель --- СТРАНная_Девочка
  stick --- stɪk --- прилипать, липнуть, палка, посох --- лаСТИК прилип к палочке --- лаСТИК
  rest --- rɛst --- покой, отдых, отдыхать --- в_РЕСТоране отдыхают --- в_РЕСТоране
  flick --- flɪk --- слегка ударить, щёлкнуть, хлестнуть, стегнуть --- flɪk по носу
  flickering --- flɪkərɪŋ --- мигающий, мерцающий, колеблющийся, мерцание, мигание --- flɪkərɪŋ свет
  firelight --- faɪərlaɪt --- свет от камина, свет от костра --- faɪərlaɪt мерцает
  horror --- hɔrə(r) --- ужас, отвращение --- ХОР ужасов --- ХОР
  what little --- wʌt lɪtəl --- то немногое --- ВОТки_ЛИТр то немногое что осталось --- ВОТки_ЛИТр
  gash --- ɡæʃ --- глубокая рана, разрез, наносить глубокую рану, мрачного вида --- ɡæʃ в душЕ
  inch --- ɪntʃ --- дюйм --- ɪntʃ
  inches --- ɪnʧəz --- дюймы --- ɪnʧəz
  apart --- ə'pɑrt --- отдельно, обособленно --- А_ПАРТия отдельно голосует --- А_ПАРТИя
  scored --- skɔrd --- имеющий на поверхности какие-л. отметины --- С_КОРДом имеющим отметины на поверхности --- С_КОРДом
  waist --- weɪst --- талия (пояс) --- weɪst как у девушки

      `,`

    `]);

    // /* ‘ ˈ æ ʒ dʒ ʌ */
