const words30 = `
Грозный --- Иван родился 1530 --- ГуБы иКоНа ---- первый царь
beach --- bi:tʃ --- МОРСКОЙ БЕРЕГ, ПЛЯЖ, ОТМЕЛЬ, НАССКОЧИТЬ НА ОТМЕЛЬ --- БИЧ на пляже
bead --- bi:d --- БУСИНКА --- БИИДон с бусинками
bеаk --- bi:k--- КЛЮВ --- БИИКини в клюве пеликана
beam --- bi:m --- ЛУЧ, СИЯЯНИЕ, УЛЫБКА, СИЯТЬ --- БИИМ сияет улыбкой
bean --- bi:n --- БОБ --- БИИНокль для бобов
bear --- bεə --- МЕДВЕДЬ --- БЕЭлый медведь
bеаst --- bi:st --- ЗВЕРЬ --- БИИСТрый зверь
beat --- bi:t --- БИТЬ, ОТБИВАТЬ --- БИИТу бить - отбивать
bеаuty --- bju:ti --- KPACOTA, КРАСАВИЦА --- БЬЮУ ТИхо красавицу
beaver --- bi:və --- БОБР --- БИИВЕнь у бобра отсох
beaver --- bi:və --- ЗАБРАЛО --- БИИВЕнь забрало проткнул
beсkоn --- bek(ə)n --- КИВАТЬ, ПОДЗЫВАТЬ --- БЕКоН кивнул официанту и подозвал БЕКоН.
bеd --- bed --- KPOBATЬ, ПОСТЕЛЬ, КЛУМБА, ГРЯДКА, САЖАТЬ ГРЯДКУ --- БЕДную кровать превратили в клумбу
`;

const words84 = `
Грозный --- Иван умер 1584 --- ГуБы оВоЩ ---- первый царь
drag --- dræɡ --- тащить(ся), тянуть, землечерпалка --- ДРЭГоценности тащить землечерпалкой
draw --- drɔː --- рисовать, чертить --- ДРООжь мешает рисовать
draw --- drɔː --- тяга, натяжение, лотерея, тащить, вытаскивать --- ДРООва тащить
drawer --- drɔː(r) --- чертёжник, рисовальщик --- ДРООРва чертёжник рисовал
drawer --- drɔː(r) --- выдвижной ящик --- ДРООРва в выдвижном ящике
drawer --- drɔː(r) --- буфетчик --- ДРООРва буфетчик рубил
drawers --- ˈdrɔː(r)z --- кальсоны --- ДРООЗд в кальсонах
dream --- driːm --- сон, сновидение, мечта, видеть сон, мечтать, сниться --- ДРИИМота сну не помеха
dress --- dres --- платье, одежда, одеваться, наряжаться --- ДРЕСсировщица в платье
`;

const words64 = `
Галилео --- Галилей родился 1564 --- ГуБы ЛуЧ ---- Италия
сорреr --- kɔpə --- ПОЛИИЦЕЙСКИЙ (разг.) --- КООПЕйка у полицейского
copy --- kɔpi --- ЭКЗЕМПЛЯР, РУКОПИСЬ, КОПИЯ, РЕПРОДУККЦИЯ, КОПИРОВАТЬ --- КОПИровать копию рукописи
copybook --- kɔpibuk --- ТЕТРАДЬ С ПРОПИСЬЮ --- КОПИровать БУКвы в тетрадь
cord --- kɔ:d --- ВЕРЕВКА, ШНУРОК, СВЯЗЫВАТЬ ВЕРЕВКОЙ --- КООрД из веревки
cork --- kɔ:k --- ПРОБКА, ПРОБКОВЫЙ, ЗАТЫКАТЬ ПРОБКОЙ --- КООКон из пробки
corn --- kɔ:n --- ЗЕРНО, СООБИРАТЬ ЗЕРНО, ПШЕНИЦА --- КООНь в зерне
corn --- kɔ:n --- МОЗОЛЬ --- КООНь с мозолью
`;


const words42 = `
Галилео --- Галилей умер 1642 --- ГуаШь ЩиТ ---- Италия
calm --- ka:m --- ТИШИНА, СПОКОЙСТВИЕ, СПОКОЙНЫЙ, УСПОКАИВАТЬ --- КААМина в тишине спокойный треск
camel --- kæməl --- ВЕРБЛЮД --- На сигаретах КЕМЕЛ нарисован верблюд
camp --- kæmp --- ЛАГЕРЬ, РАСПОЛАГАТЬСЯ ЛАГЕРЕМ --- КЕМПинг - лагерь для автотуристов
can --- kæn --- МОЧЬ, УМЕТЬ --- КЕНгуру может прыгать
can --- kæn --- БИДОН, БАНКА КОНСЕРВОВ, КОНСЕРВИРОВАТЬ --- КЕНгуру любит консервы
саnсеl --- kænsəl --- ОТМЕНЯТЬ --- КОНСИЛиум отменили
candid --- 'kændid --- ИСКРЕННИЙ --- КАНДИДат искренний
`;

const wordsAll = {
  30: words30,
  42: words42,
  64: words64,
  84: words84,
};
