const words030 = `
Грозный --- 1530-1584 --- первый царь --- 1530-1584 ГуБы иКоНа ГуБы оВоЩ
beach --- bi:tʃ --- морской берег, пляж, отмель, наскочить на отмель --- БИЧ на пляже
bead --- bi:d --- бусинка --- БИИДон с бусинками
bеаk --- bi:k--- клюв --- БИИКини в клюве пеликана
beam --- bi:m --- луч, сияние, улыбка, сиять --- БИИМ сияет улыбкой
bean --- bi:n --- боб, фасоль --- БИИНокль для бобов
bear --- bεə --- медведь --- БЕЭлый медведь
bеаst --- bi:st --- зверь --- БИИСТрый зверь
beat --- bi:t --- бить, отбивать --- БИИТой бить да отбивать
bеаuty --- bju:ti --- красота, красавица --- БЬЮУ_ТИхо красавицу
beaver --- bi:və --- бобр --- БИИВЕнь у бобра отсох
beaver --- bi:və --- забрало --- БИИВЕнь забрало проткнул
beсkоn --- bek(ə)n --- кивать, подзывать --- БЕКоН кивнул официанту и подозвал БЕКоН.
bеd --- bed --- кровать, постель, клумба, грядка, сажать грядку --- БЕДную кровать превратили в клумбу
`;

const words084 = `
Грозный --- 1530-1584 --- первый царь --- 1530-1584 ГуБы иКоНа ГуБы оВоЩ
drag --- dræɡ --- тащить(ся), тянуть, землечерпалка --- ДРЭГоценности тащить землечерпалкой
draw --- drɔː --- рисовать, чертить --- ДРООжь мешает рисовать
draw --- drɔː --- тяга, натяжение, лотерея, тащить, вытаскивать --- ДРООва тащить
drawer --- drɔː(r) --- чертёжник, рисовальщик --- ДРООРва чертёжник рисовал
drawer --- drɔː(r) --- выдвижной ящик --- ДРООРва в выдвижном ящике
drawer --- drɔː(r) --- буфетчик --- ДРООРва буфетчик рубил
drawers --- ˈdrɔː(r)z --- кальсоны --- ДРООЗд в кальсонах
dream --- driːm --- сон, сновидение, мечта, видеть сон, мечтать, сниться --- ДРИИМота сну не помеха
dress --- dres --- платье, одежда, одеваться, наряжаться --- ДРЕСсировщица в платье
`;

const words064 = `
Галилео --- 1564-1642 --- Италия, Пиза --- 1564-1642 ГуБы ЛуЧ ГуаШь ЩиТ
сорреr --- kɔpə --- полицейский (разг.) --- КОПЕйка у полицейского
copy --- kɔpi --- экземпляр, рукопись, копия, репродукция, копировать --- КОПИровать копию рукописи
copybook --- kɔpibuk --- тетрадь с прописью --- КОПИровать_БУКвы в тетрадь
cord --- kɔ:d --- веревка, шнурок, связывать веревкой --- КООрД из веревки на шнурке
cork --- kɔ:k --- пробка, пробковый, затыкать пробкой --- КООКон c пробкой
corn --- kɔ:n --- зерно, сообирать зерно, пшеница --- КООНь в зерне
corn --- kɔ:n --- мозоль --- КООНь с мозолью
`;

const words042 = `
Галилео --- 1564-1642 --- Италия --- 1564-1642 ГуБы ЛуЧ ГуаШь ЩиТ
calm --- ka:m --- тишина, спокойствие, спокойный, успокаивать --- КААМин в тишине успокаивает
camel --- kæməl --- верблюд --- КЕМЕЛ это верблюд на сигаретах
camp --- kæmp --- лагерь, располагаться лагерем --- КЕМПинг - лагерь для автотуристов
can --- kæn --- мочь, уметь --- КЕНгуру может прыгать
can --- kæn --- бидон, банка консервов, консервировать --- КЕНгуру любит консервы из банки
саnсеl --- kænsəl --- отменять --- КОНСИЛиум отменили
candid --- ‘kændid --- искренний --- КАНДИДат искренний
`;

const words052 = `
да Винчи --- 1452-1519 --- Италия, Флоренция --- 1452-1519 ЖуЧок БиТа ГуБы ГиРя
chute --- ʃu:t --- крутой скат, стремнина (устар.) --- ШУУТ с крутого ската скатился в стремнину
circle --- sə:kl --- круг, окружность, орбита, цикл, вращаться --- CЁОKoЛ на орбите вращается по круг
city --- ‘siti --- большой город --- СИТо большого города
claim --- kleim --- требование, требовать, иск, претензия --- КЛЕЙМо требует выставить претензию
`;

const words019 = `
да Винчи --- 1452-1519 --- Франция --- 1452-1519 ЖуЧок БиТа ГуБы ГиРя
across --- ə’krɔs --- поперёк, на той стороне, крест накрест --- КРОСс на той стороне поперёк правил
add --- æd --- прибавлять, присоединять, дополнять --- АД прибавит проблем
addict --- ‘ædikt --- пристраститься к чему-либо, нарокоман --- ЭДИК_То наркоман
admit --- əd’mit --- разрешать, впускать, допускать, вмещать --- АДин_МИТинг разрешили провести
admix --- əd’miks --- примешивать, смешивать(ся) --- ЕДу_МИКСером примешивали
adore --- ə’dɔ: --- обожать, поклоняться --- Этот_ДООм обожают и поклоняются
advice --- əd’vais --- совет, консультация, извещение --- ОДеВАЙСя мой совет
affair --- ə’fεə --- дело --- ФЕЯ дело знает
`;

// ‘ æ

const quickLinks = ['052', '019', '064', '042', '030', '084'];

const wordsAll = {
  '019': words019,
  '030': words030,
  '042': words042,
  '052': words052,
  '064': words064,
  '084': words084,
};

