const words30 = `
beach --- bi:tʃ --- МОРСКОЙ БЕРЕГ, ПЛЯЖ, ОТМЕЛЬ, НАССКОЧИТЬ НА ОТМЕЛЬ --- БИЧ на пляже
bead --- bi:d --- БУСИНКА --- БИИДон с бусинками
bеаk --- bi:k--- КЛЮВ --- БИИКини в клюве пеликана
beam --- bi:m --- ЛУЧ, СИЯЯНИЕ, УЛЫБКА, СИЯТЬ --- БИИМ сияет улыбкой
bean --- bi:n --- БОБ --- БИИНокль для бобов
bear --- bεə --- МЕДВЕДЬ --- БЕЭлый медведь
bеаst --- bi:st --- ЗВЕРЬ --- БИИСТрый зверь
beat --- bi:t --- БИТЬ, ОТБИВАТЬ --- БИИТу бить - отбивать
bеаuty --- bju:ti --- KPACOTA, КРАСАВИЦА --- БЬЮУ ТИхо красавицу
beaver --- bi:və --- БОБР --- БИИВЕнь у бобра отсох
beaver --- bi:və --- ЗАБРАЛО --- БИИВЕнь забрало проткнул
beсkоn --- bek(ə)n --- КИВАТЬ, ПОДЗЫВАТЬ --- БЕКоН кивнул официанту и заказал БЕКоН.
bеd --- bed --- KPOBATЬ, ПОСТЕЛЬ, КЛУМБА, ГРЯДКА, САЖАТЬ ГРЯДКУ --- БЕДную кровать превратили в клумбу
`;

const words84 = `
drag --- dræɡ --- тащить(ся), тянуть, землечерпалка --- тащить ДРЭГоценности землечерпалкой
draw --- drɔː --- рисовать, чертить --- ДРООжь мешает рисовать
draw --- drɔː --- тяга, натяжение, лотерея, тащить, вытаскивать --- тащить ДРООва
drawer --- drɔː(r) --- чертёжник, рисовальщик --- чертёжник рисовал ДРООРва
drawer --- drɔː(r) --- выдвижной ящик --- порубил на ДРООРва выдвижной ящик
drawer --- drɔː(r) --- буфетчик --- ДРООРва рубил буфетчик
drawers --- ˈdrɔː(r)z --- кальсоны --- ДРООЗд в кальсонах
dream --- driːm --- сон, сновидение, мечта, видеть сон, мечтать, сниться --- ДРИИМота переходит в сон
dress --- dres --- платье, одежда, одеваться, наряжаться --- ДРЕСсировщица в красивом платье
`;

const wordsAll = {
  words30: words30,
  words84: words84,
};
